---
translated: true
---

# Apache AGE

>[Apache AGE](https://age.apache.org/)ëŠ” ê·¸ë˜í”„ ë°ì´í„°ë² ì´ìŠ¤ ê¸°ëŠ¥ì„ ì œê³µí•˜ëŠ” PostgreSQL í™•ì¥ì…ë‹ˆë‹¤. AGEëŠ” A Graph Extensionì˜ ì•½ìì´ë©°, Bitnineì˜ PostgreSQL 10 forkì¸ AgensGraphì—ì„œ ì˜ê°ì„ ë°›ì•˜ìŠµë‹ˆë‹¤. ì´ í”„ë¡œì íŠ¸ì˜ ëª©í‘œëŠ” ê´€ê³„í˜• ë° ê·¸ë˜í”„ ëª¨ë¸ ë°ì´í„°ë¥¼ ëª¨ë‘ ì²˜ë¦¬í•  ìˆ˜ ìˆëŠ” ë‹¨ì¼ ì €ì¥ì†Œë¥¼ ë§Œë“œëŠ” ê²ƒì´ë©°, ì‚¬ìš©ìëŠ” í‘œì¤€ ANSI SQLê³¼ ê·¸ë˜í”„ ì¿¼ë¦¬ ì–¸ì–´ì¸ openCypherì„ í•¨ê»˜ ì‚¬ìš©í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤. `Apache AGE`ê°€ ì €ì¥í•˜ëŠ” ë°ì´í„° ìš”ì†ŒëŠ” ë…¸ë“œ, ì´ë“¤ì„ ì—°ê²°í•˜ëŠ” ì—£ì§€, ê·¸ë¦¬ê³  ë…¸ë“œì™€ ì—£ì§€ì˜ ì†ì„±ì…ë‹ˆë‹¤.

>ì´ ë…¸íŠ¸ë¶ì€ `Cypher` ì¿¼ë¦¬ ì–¸ì–´ë¥¼ ì‚¬ìš©í•˜ì—¬ ê·¸ë˜í”„ ë°ì´í„°ë² ì´ìŠ¤ë¥¼ ì¿¼ë¦¬í•  ìˆ˜ ìˆëŠ” ìì—°ì–´ ì¸í„°í˜ì´ìŠ¤ë¥¼ ì œê³µí•˜ëŠ” LLM(Large Language Model)ì˜ ì‚¬ìš© ë°©ë²•ì„ ë³´ì—¬ì¤ë‹ˆë‹¤.

>[Cypher](https://en.wikipedia.org/wiki/Cypher_(query_language))ëŠ” ì†ì„± ê·¸ë˜í”„ì—ì„œ í‘œí˜„ë ¥ ìˆê³  íš¨ìœ¨ì ì¸ ë°ì´í„° ì¿¼ë¦¬ë¥¼ í—ˆìš©í•˜ëŠ” ì„ ì–¸ì  ê·¸ë˜í”„ ì¿¼ë¦¬ ì–¸ì–´ì…ë‹ˆë‹¤.

## ì„¤ì •

AGE í™•ì¥ì´ ì„¤ì¹˜ëœ ì‹¤í–‰ ì¤‘ì¸ `Postgre` ì¸ìŠ¤í„´ìŠ¤ê°€ í•„ìš”í•©ë‹ˆë‹¤. í…ŒìŠ¤íŠ¸ë¥¼ ìœ„í•œ í•œ ê°€ì§€ ì˜µì…˜ì€ ê³µì‹ AGE ë„ì»¤ ì´ë¯¸ì§€ë¥¼ ì‚¬ìš©í•˜ì—¬ ë„ì»¤ ì»¨í…Œì´ë„ˆë¥¼ ì‹¤í–‰í•˜ëŠ” ê²ƒì…ë‹ˆë‹¤.
ë‹¤ìŒ ìŠ¤í¬ë¦½íŠ¸ë¥¼ ì‹¤í–‰í•˜ì—¬ ë¡œì»¬ ë„ì»¤ ì»¨í…Œì´ë„ˆë¥¼ ì‹¤í–‰í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤:

```bash
docker run \
    --name age  \
    -p 5432:5432 \
    -e POSTGRES_USER=postgresUser \
    -e POSTGRES_PASSWORD=postgresPW \
    -e POSTGRES_DB=postgresDB \
    -d \
    apache/age
```

ë„ì»¤ì—ì„œ ì‹¤í–‰í•˜ëŠ” ë°©ë²•ì— ëŒ€í•œ ì¶”ê°€ ì§€ì¹¨ì€ [ì—¬ê¸°](https://hub.docker.com/r/apache/age)ì—ì„œ ì°¾ì„ ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
from langchain.chains import GraphCypherQAChain
from langchain_community.graphs.age_graph import AGEGraph
from langchain_openai import ChatOpenAI
```

```python
conf = {
    "database": "postgresDB",
    "user": "postgresUser",
    "password": "postgresPW",
    "host": "localhost",
    "port": 5432,
}

graph = AGEGraph(graph_name="age_test", conf=conf)
```

## ë°ì´í„°ë² ì´ìŠ¤ ì‹œë“œ ì„¤ì •

ë°ì´í„°ë² ì´ìŠ¤ê°€ ë¹„ì–´ ìˆë‹¤ê³  ê°€ì •í•˜ë©´, Cypher ì¿¼ë¦¬ ì–¸ì–´ë¥¼ ì‚¬ìš©í•˜ì—¬ ë°ì´í„°ë² ì´ìŠ¤ë¥¼ ì±„ìš¸ ìˆ˜ ìˆìŠµë‹ˆë‹¤. ë‹¤ìŒ Cypher ë¬¸ì€ idempotentí•˜ë¯€ë¡œ í•œ ë²ˆ ë˜ëŠ” ì—¬ëŸ¬ ë²ˆ ì‹¤í–‰í•´ë„ ë°ì´í„°ë² ì´ìŠ¤ ì •ë³´ê°€ ë™ì¼í•©ë‹ˆë‹¤.

```python
graph.query(
    """
MERGE (m:Movie {name:"Top Gun"})
WITH m
UNWIND ["Tom Cruise", "Val Kilmer", "Anthony Edwards", "Meg Ryan"] AS actor
MERGE (a:Actor {name:actor})
MERGE (a)-[:ACTED_IN]->(m)
"""
)
```

```output
[]
```

## ê·¸ë˜í”„ ìŠ¤í‚¤ë§ˆ ì •ë³´ ìƒˆë¡œ ê³ ì¹¨

ë°ì´í„°ë² ì´ìŠ¤ ìŠ¤í‚¤ë§ˆê°€ ë³€ê²½ë˜ë©´ Cypher ë¬¸ì„ ìƒì„±í•˜ëŠ” ë° í•„ìš”í•œ ìŠ¤í‚¤ë§ˆ ì •ë³´ë¥¼ ìƒˆë¡œ ê³ ì¹  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
graph.refresh_schema()
```

```python
print(graph.schema)
```

```output

        Node properties are the following:
        [{'properties': [{'property': 'name', 'type': 'STRING'}], 'labels': 'Actor'}, {'properties': [{'property': 'property_a', 'type': 'STRING'}], 'labels': 'LabelA'}, {'properties': [], 'labels': 'LabelB'}, {'properties': [], 'labels': 'LabelC'}, {'properties': [{'property': 'name', 'type': 'STRING'}], 'labels': 'Movie'}]
        Relationship properties are the following:
        [{'properties': [], 'type': 'ACTED_IN'}, {'properties': [{'property': 'rel_prop', 'type': 'STRING'}], 'type': 'REL_TYPE'}]
        The relationships are the following:
        ['(:`Actor`)-[:`ACTED_IN`]->(:`Movie`)', '(:`LabelA`)-[:`REL_TYPE`]->(:`LabelB`)', '(:`LabelA`)-[:`REL_TYPE`]->(:`LabelC`)']
```

## ê·¸ë˜í”„ ì¿¼ë¦¬

ì´ì œ ê·¸ë˜í”„ Cypher QA ì²´ì¸ì„ ì‚¬ìš©í•˜ì—¬ ê·¸ë˜í”„ì— ì§ˆë¬¸í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True
)
```

```python
chain.invoke("Who played in Top Gun?")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m

Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'name': 'Tom Cruise'}, {'name': 'Val Kilmer'}, {'name': 'Anthony Edwards'}, {'name': 'Meg Ryan'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Tom Cruise, Val Kilmer, Anthony Edwards, Meg Ryan played in Top Gun.'}
```

## ê²°ê³¼ ìˆ˜ ì œí•œ

Cypher QA ì²´ì¸ì—ì„œ `top_k` ë§¤ê°œë³€ìˆ˜ë¥¼ ì‚¬ìš©í•˜ì—¬ ê²°ê³¼ ìˆ˜ë¥¼ ì œí•œí•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.
ê¸°ë³¸ê°’ì€ 10ì…ë‹ˆë‹¤.

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, top_k=2
)
```

```python
chain.invoke("Who played in Top Gun?")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie {name: 'Top Gun'})
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'name': 'Tom Cruise'}, {'name': 'Val Kilmer'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Tom Cruise, Val Kilmer played in Top Gun.'}
```

## ì¤‘ê°„ ê²°ê³¼ ë°˜í™˜

Cypher QA ì²´ì¸ì—ì„œ `return_intermediate_steps` ë§¤ê°œë³€ìˆ˜ë¥¼ ì‚¬ìš©í•˜ì—¬ ì¤‘ê°„ ë‹¨ê³„ë¥¼ ë°˜í™˜í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, return_intermediate_steps=True
)
```

```python
result = chain("Who played in Top Gun?")
print(f"Intermediate steps: {result['intermediate_steps']}")
print(f"Final answer: {result['result']}")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'name': 'Tom Cruise'}, {'name': 'Val Kilmer'}, {'name': 'Anthony Edwards'}, {'name': 'Meg Ryan'}][0m

[1m> Finished chain.[0m
Intermediate steps: [{'query': "MATCH (a:Actor)-[:ACTED_IN]->(m:Movie)\nWHERE m.name = 'Top Gun'\nRETURN a.name"}, {'context': [{'name': 'Tom Cruise'}, {'name': 'Val Kilmer'}, {'name': 'Anthony Edwards'}, {'name': 'Meg Ryan'}]}]
Final answer: Tom Cruise, Val Kilmer, Anthony Edwards, Meg Ryan played in Top Gun.
```

## ì§ì ‘ ê²°ê³¼ ë°˜í™˜

Cypher QA ì²´ì¸ì—ì„œ `return_direct` ë§¤ê°œë³€ìˆ˜ë¥¼ ì‚¬ìš©í•˜ì—¬ ì§ì ‘ ê²°ê³¼ë¥¼ ë°˜í™˜í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, return_direct=True
)
```

```python
chain.invoke("Who played in Top Gun?")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie {name: 'Top Gun'})
RETURN a.name[0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': [{'name': 'Tom Cruise'},
  {'name': 'Val Kilmer'},
  {'name': 'Anthony Edwards'},
  {'name': 'Meg Ryan'}]}
```

## Cypher ìƒì„± í”„ë¡¬í”„íŠ¸ì— ì˜ˆì œ ì¶”ê°€

íŠ¹ì • ì§ˆë¬¸ì— ëŒ€í•´ ìƒì„±í•˜ë ¤ëŠ” Cypher ë¬¸ì„ ì •ì˜í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
from langchain_core.prompts.prompt import PromptTemplate

CYPHER_GENERATION_TEMPLATE = """Task:Generate Cypher statement to query a graph database.
Instructions:
Use only the provided relationship types and properties in the schema.
Do not use any other relationship types or properties that are not provided.
Schema:
{schema}
Note: Do not include any explanations or apologies in your responses.
Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.
Do not include any text except the generated Cypher statement.
Examples: Here are a few examples of generated Cypher statements for particular questions:
# How many people played in Top Gun?
MATCH (m:Movie {{title:"Top Gun"}})<-[:ACTED_IN]-()
RETURN count(*) AS numberOfActors

The question is:
{question}"""

CYPHER_GENERATION_PROMPT = PromptTemplate(
    input_variables=["schema", "question"], template=CYPHER_GENERATION_TEMPLATE
)

chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0),
    graph=graph,
    verbose=True,
    cypher_prompt=CYPHER_GENERATION_PROMPT,
)
```

```python
chain.invoke("How many people played in Top Gun?")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m

Generated Cypher:
[32;1m[1;3mMATCH (:Movie {name:"Top Gun"})<-[:ACTED_IN]-(:Actor)
RETURN count(*) AS numberOfActors[0m
Full Context:
[32;1m[1;3m[{'numberofactors': 4}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'How many people played in Top Gun?',
 'result': "I don't know the answer."}
```

## Cypherì™€ ë‹µë³€ ìƒì„±ì„ ìœ„í•´ ë³„ë„ì˜ LLM ì‚¬ìš©

`cypher_llm` ë° `qa_llm` ë§¤ê°œë³€ìˆ˜ë¥¼ ì‚¬ìš©í•˜ì—¬ ë‹¤ë¥¸ LLMì„ ì •ì˜í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
chain = GraphCypherQAChain.from_llm(
    graph=graph,
    cypher_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo"),
    qa_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo-16k"),
    verbose=True,
)
```

```python
chain.invoke("Who played in Top Gun?")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m

Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'name': 'Tom Cruise'}, {'name': 'Val Kilmer'}, {'name': 'Anthony Edwards'}, {'name': 'Meg Ryan'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Tom Cruise, Val Kilmer, Anthony Edwards, and Meg Ryan played in Top Gun.'}
```

## ì§€ì •ëœ ë…¸ë“œ ë° ê´€ê³„ ìœ í˜• ë¬´ì‹œ

`include_types` ë˜ëŠ” `exclude_types`ë¥¼ ì‚¬ìš©í•˜ì—¬ ê·¸ë˜í”„ ìŠ¤í‚¤ë§ˆì˜ ì¼ë¶€ë¥¼ ë¬´ì‹œí•˜ê³  Cypher ë¬¸ì„ ìƒì„±í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
chain = GraphCypherQAChain.from_llm(
    graph=graph,
    cypher_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo"),
    qa_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo-16k"),
    verbose=True,
    exclude_types=["Movie"],
)
```

```python
# Inspect graph schema
print(chain.graph_schema)
```

```output
Node properties are the following:
Actor {name: STRING},LabelA {property_a: STRING},LabelB {},LabelC {}
Relationship properties are the following:
ACTED_IN {},REL_TYPE {rel_prop: STRING}
The relationships are the following:
(:LabelA)-[:REL_TYPE]->(:LabelB),(:LabelA)-[:REL_TYPE]->(:LabelC)
```

## ìƒì„±ëœ Cypher ë¬¸ ê²€ì¦

`validate_cypher` ë§¤ê°œë³€ìˆ˜ë¥¼ ì‚¬ìš©í•˜ì—¬ ìƒì„±ëœ Cypher ë¬¸ì„ ê²€ì¦í•˜ê³  ê´€ê³„ ë°©í–¥ì„ ìˆ˜ì •í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
chain = GraphCypherQAChain.from_llm(
    llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo"),
    graph=graph,
    verbose=True,
    validate_cypher=True,
)
```

```python
chain.invoke("Who played in Top Gun?")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'name': 'Tom Cruise'}, {'name': 'Val Kilmer'}, {'name': 'Anthony Edwards'}, {'name': 'Meg Ryan'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Tom Cruise, Val Kilmer, Anthony Edwards, Meg Ryan played in Top Gun.'}
```
