---
translated: true
---

# Neo4j

>[Neo4j](https://neo4j.com/docs/getting-started/)ëŠ” `Neo4j, Inc`ì—ì„œ ê°œë°œí•œ ê·¸ë˜í”„ ë°ì´í„°ë² ì´ìŠ¤ ê´€ë¦¬ ì‹œìŠ¤í…œì…ë‹ˆë‹¤.

>Neo4jê°€ ì €ì¥í•˜ëŠ” ë°ì´í„° ìš”ì†ŒëŠ” ë…¸ë“œ, ì´ë“¤ì„ ì—°ê²°í•˜ëŠ” ì—£ì§€, ê·¸ë¦¬ê³  ë…¸ë“œì™€ ì—£ì§€ì˜ ì†ì„±ì…ë‹ˆë‹¤. ê°œë°œìë“¤ì€ Neo4jë¥¼ ACID ì¤€ìˆ˜ íŠ¸ëœì­ì…˜ ë°ì´í„°ë² ì´ìŠ¤ì´ì ë„¤ì´í‹°ë¸Œ ê·¸ë˜í”„ ì €ì¥ì†Œ ë° ì²˜ë¦¬ ê¸°ëŠ¥ì„ ê°€ì§„ ê²ƒìœ¼ë¡œ ì„¤ëª…í•©ë‹ˆë‹¤. Neo4jëŠ” GNU General Public License ë³€í˜•ìœ¼ë¡œ ë¼ì´ì„ ìŠ¤ëœ ë¹„ì˜¤í”ˆì†ŒìŠ¤ "ì»¤ë®¤ë‹ˆí‹° ì—ë””ì…˜"ê³¼ ì˜¨ë¼ì¸ ë°±ì—… ë° ê³ ê°€ìš©ì„± í™•ì¥ ê¸°ëŠ¥ì´ í¬í•¨ëœ íì‡„ ì†ŒìŠ¤ ìƒìš© ë¼ì´ì„ ìŠ¤ë¡œ ì œê³µë©ë‹ˆë‹¤.

>ì´ ë…¸íŠ¸ë¶ì€ `Cypher` ì¿¼ë¦¬ ì–¸ì–´ë¡œ ê·¸ë˜í”„ ë°ì´í„°ë² ì´ìŠ¤ë¥¼ ì¿¼ë¦¬í•  ìˆ˜ ìˆëŠ” ìì—°ì–´ ì¸í„°í˜ì´ìŠ¤ë¥¼ ì œê³µí•˜ëŠ” LLMì˜ ì‚¬ìš© ë°©ë²•ì„ ë³´ì—¬ì¤ë‹ˆë‹¤.

>[Cypher](https://en.wikipedia.org/wiki/Cypher_(query_language))ëŠ” ì†ì„± ê·¸ë˜í”„ì—ì„œ í‘œí˜„ë ¥ ìˆê³  íš¨ìœ¨ì ì¸ ë°ì´í„° ì¿¼ë¦¬ë¥¼ ê°€ëŠ¥í•˜ê²Œ í•˜ëŠ” ì„ ì–¸í˜• ê·¸ë˜í”„ ì¿¼ë¦¬ ì–¸ì–´ì…ë‹ˆë‹¤.

## ì„¤ì •

ì‹¤í–‰ ì¤‘ì¸ `Neo4j` ì¸ìŠ¤í„´ìŠ¤ê°€ í•„ìš”í•©ë‹ˆë‹¤. ì˜µì…˜ ì¤‘ í•˜ë‚˜ëŠ” [Neo4j Aura í´ë¼ìš°ë“œ ì„œë¹„ìŠ¤](https://neo4j.com/cloud/platform/aura-graph-database/)ì—ì„œ ë¬´ë£Œ Neo4j ë°ì´í„°ë² ì´ìŠ¤ ì¸ìŠ¤í„´ìŠ¤ë¥¼ ë§Œë“œëŠ” ê²ƒì…ë‹ˆë‹¤. ë˜í•œ [Neo4j Desktop ì• í”Œë¦¬ì¼€ì´ì…˜](https://neo4j.com/download/)ì„ ì‚¬ìš©í•˜ê±°ë‚˜ Docker ì»¨í…Œì´ë„ˆë¥¼ ì‹¤í–‰í•˜ì—¬ ë°ì´í„°ë² ì´ìŠ¤ë¥¼ ë¡œì»¬ì—ì„œ ì‹¤í–‰í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.
ë‹¤ìŒ ìŠ¤í¬ë¦½íŠ¸ë¥¼ ì‹¤í–‰í•˜ì—¬ ë¡œì»¬ Docker ì»¨í…Œì´ë„ˆë¥¼ ì‹¤í–‰í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤:

```bash
docker run \
    --name neo4j \
    -p 7474:7474 -p 7687:7687 \
    -d \
    -e NEO4J_AUTH=neo4j/password \
    -e NEO4J_PLUGINS=\[\"apoc\"\]  \
    neo4j:latest
```

Docker ì»¨í…Œì´ë„ˆë¥¼ ì‚¬ìš©í•˜ëŠ” ê²½ìš° ë°ì´í„°ë² ì´ìŠ¤ê°€ ì‹œì‘ë˜ëŠ” ë° ëª‡ ì´ˆ ì •ë„ ê±¸ë¦½ë‹ˆë‹¤.

```python
from langchain.chains import GraphCypherQAChain
from langchain_community.graphs import Neo4jGraph
from langchain_openai import ChatOpenAI
```

```python
graph = Neo4jGraph(url="bolt://localhost:7687", username="neo4j", password="password")
```

## ë°ì´í„°ë² ì´ìŠ¤ ì‹œë“œ ì„¤ì •

ë°ì´í„°ë² ì´ìŠ¤ê°€ ë¹„ì–´ ìˆë‹¤ê³  ê°€ì •í•˜ë©´ Cypher ì¿¼ë¦¬ ì–¸ì–´ë¥¼ ì‚¬ìš©í•˜ì—¬ ë°ì´í„°ë² ì´ìŠ¤ë¥¼ ì±„ìš¸ ìˆ˜ ìˆìŠµë‹ˆë‹¤. ë‹¤ìŒ Cypher ë¬¸ì€ ë©±ë“±ì„±ì´ ìˆì–´ í•œ ë²ˆ ë˜ëŠ” ì—¬ëŸ¬ ë²ˆ ì‹¤í–‰í•´ë„ ë°ì´í„°ë² ì´ìŠ¤ ì •ë³´ê°€ ë™ì¼í•©ë‹ˆë‹¤.

```python
graph.query(
    """
MERGE (m:Movie {name:"Top Gun", runtime: 120})
WITH m
UNWIND ["Tom Cruise", "Val Kilmer", "Anthony Edwards", "Meg Ryan"] AS actor
MERGE (a:Actor {name:actor})
MERGE (a)-[:ACTED_IN]->(m)
"""
)
```

```output
[]
```

## ê·¸ë˜í”„ ìŠ¤í‚¤ë§ˆ ì •ë³´ ìƒˆë¡œ ê³ ì¹¨

ë°ì´í„°ë² ì´ìŠ¤ ìŠ¤í‚¤ë§ˆê°€ ë³€ê²½ë˜ë©´ Cypher ë¬¸ì„ ìƒì„±í•˜ëŠ” ë° í•„ìš”í•œ ìŠ¤í‚¤ë§ˆ ì •ë³´ë¥¼ ìƒˆë¡œ ê³ ì¹  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
graph.refresh_schema()
```

```python
print(graph.schema)
```

```output
Node properties:
Movie {runtime: INTEGER, name: STRING}
Actor {name: STRING}
Relationship properties:

The relationships:
(:Actor)-[:ACTED_IN]->(:Movie)
```

## í–¥ìƒëœ ìŠ¤í‚¤ë§ˆ ì •ë³´

í–¥ìƒëœ ìŠ¤í‚¤ë§ˆ ë²„ì „ì„ ì„ íƒí•˜ë©´ ì‹œìŠ¤í…œì´ ë°ì´í„°ë² ì´ìŠ¤ ë‚´ì˜ ì˜ˆì œ ê°’ì„ ìë™ìœ¼ë¡œ ìŠ¤ìº”í•˜ê³  ì¼ë¶€ ë¶„í¬ ì§€í‘œë¥¼ ê³„ì‚°í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤. ì˜ˆë¥¼ ë“¤ì–´ ë…¸ë“œ ì†ì„±ì— 10ê°œ ë¯¸ë§Œì˜ ê³ ìœ  ê°’ì´ ìˆëŠ” ê²½ìš° ëª¨ë“  ê°€ëŠ¥í•œ ê°’ì„ ìŠ¤í‚¤ë§ˆì— ë°˜í™˜í•©ë‹ˆë‹¤. ê·¸ë ‡ì§€ ì•Šìœ¼ë©´ ë…¸ë“œ ë° ê´€ê³„ ì†ì„±ë‹¹ í•˜ë‚˜ì˜ ì˜ˆì œ ê°’ë§Œ ë°˜í™˜í•©ë‹ˆë‹¤.

```python
enhanced_graph = Neo4jGraph(
    url="bolt://localhost:7687",
    username="neo4j",
    password="password",
    enhanced_schema=True,
)
print(enhanced_graph.schema)
```

```output
Node properties:
- **Movie**
  - `runtime: INTEGER` Min: 120, Max: 120
  - `name: STRING` Available options: ['Top Gun']
- **Actor**
  - `name: STRING` Available options: ['Tom Cruise', 'Val Kilmer', 'Anthony Edwards', 'Meg Ryan']
Relationship properties:

The relationships:
(:Actor)-[:ACTED_IN]->(:Movie)
```

## ê·¸ë˜í”„ ì¿¼ë¦¬

ì´ì œ ê·¸ë˜í”„ Cypher QA ì²´ì¸ì„ ì‚¬ìš©í•˜ì—¬ ê·¸ë˜í”„ì— ì§ˆë¬¸í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True
)
```

```python
chain.invoke({"query": "Who played in Top Gun?"})
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'a.name': 'Anthony Edwards'}, {'a.name': 'Meg Ryan'}, {'a.name': 'Val Kilmer'}, {'a.name': 'Tom Cruise'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Anthony Edwards, Meg Ryan, Val Kilmer, Tom Cruise played in Top Gun.'}
```

## ê²°ê³¼ ìˆ˜ ì œí•œ

`top_k` ë§¤ê°œë³€ìˆ˜ë¥¼ ì‚¬ìš©í•˜ì—¬ Cypher QA ì²´ì¸ì˜ ê²°ê³¼ ìˆ˜ë¥¼ ì œí•œí•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.
ê¸°ë³¸ê°’ì€ 10ì…ë‹ˆë‹¤.

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, top_k=2
)
```

```python
chain.invoke({"query": "Who played in Top Gun?"})
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'a.name': 'Anthony Edwards'}, {'a.name': 'Meg Ryan'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Anthony Edwards, Meg Ryan played in Top Gun.'}
```

## ì¤‘ê°„ ê²°ê³¼ ë°˜í™˜

`return_intermediate_steps` ë§¤ê°œë³€ìˆ˜ë¥¼ ì‚¬ìš©í•˜ì—¬ Cypher QA ì²´ì¸ì˜ ì¤‘ê°„ ë‹¨ê³„ë¥¼ ë°˜í™˜í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, return_intermediate_steps=True
)
```

```python
result = chain.invoke({"query": "Who played in Top Gun?"})
print(f"Intermediate steps: {result['intermediate_steps']}")
print(f"Final answer: {result['result']}")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'a.name': 'Anthony Edwards'}, {'a.name': 'Meg Ryan'}, {'a.name': 'Val Kilmer'}, {'a.name': 'Tom Cruise'}][0m

[1m> Finished chain.[0m
Intermediate steps: [{'query': "MATCH (a:Actor)-[:ACTED_IN]->(m:Movie)\nWHERE m.name = 'Top Gun'\nRETURN a.name"}, {'context': [{'a.name': 'Anthony Edwards'}, {'a.name': 'Meg Ryan'}, {'a.name': 'Val Kilmer'}, {'a.name': 'Tom Cruise'}]}]
Final answer: Anthony Edwards, Meg Ryan, Val Kilmer, Tom Cruise played in Top Gun.
```

## ì§ì ‘ ê²°ê³¼ ë°˜í™˜

`return_direct` ë§¤ê°œë³€ìˆ˜ë¥¼ ì‚¬ìš©í•˜ì—¬ Cypher QA ì²´ì¸ì˜ ì§ì ‘ ê²°ê³¼ë¥¼ ë°˜í™˜í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, return_direct=True
)
```

```python
chain.invoke({"query": "Who played in Top Gun?"})
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': [{'a.name': 'Anthony Edwards'},
  {'a.name': 'Meg Ryan'},
  {'a.name': 'Val Kilmer'},
  {'a.name': 'Tom Cruise'}]}
```

## Cypher ìƒì„± í”„ë¡¬í”„íŠ¸ì— ì˜ˆì œ ì¶”ê°€

íŠ¹ì • ì§ˆë¬¸ì— ëŒ€í•´ ìƒì„±í•˜ë ¤ëŠ” Cypher ë¬¸ì„ ì •ì˜í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
from langchain_core.prompts.prompt import PromptTemplate

CYPHER_GENERATION_TEMPLATE = """Task:Generate Cypher statement to query a graph database.
Instructions:
Use only the provided relationship types and properties in the schema.
Do not use any other relationship types or properties that are not provided.
Schema:
{schema}
Note: Do not include any explanations or apologies in your responses.
Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.
Do not include any text except the generated Cypher statement.
Examples: Here are a few examples of generated Cypher statements for particular questions:
# How many people played in Top Gun?
MATCH (m:Movie {{title:"Top Gun"}})<-[:ACTED_IN]-()
RETURN count(*) AS numberOfActors

The question is:
{question}"""

CYPHER_GENERATION_PROMPT = PromptTemplate(
    input_variables=["schema", "question"], template=CYPHER_GENERATION_TEMPLATE
)

chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0),
    graph=graph,
    verbose=True,
    cypher_prompt=CYPHER_GENERATION_PROMPT,
)
```

```python
chain.invoke({"query": "How many people played in Top Gun?"})
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (:Movie {name:"Top Gun"})<-[:ACTED_IN]-()
RETURN count(*) AS numberOfActors[0m
Full Context:
[32;1m[1;3m[{'numberOfActors': 4}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'How many people played in Top Gun?',
 'result': 'There were 4 actors who played in Top Gun.'}
```

## Cypherì™€ ë‹µë³€ ìƒì„±ì„ ìœ„í•œ ë³„ë„ì˜ LLM ì‚¬ìš©

`cypher_llm` ë° `qa_llm` ë§¤ê°œë³€ìˆ˜ë¥¼ ì‚¬ìš©í•˜ì—¬ ë‹¤ë¥¸ LLMì„ ì •ì˜í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
chain = GraphCypherQAChain.from_llm(
    graph=graph,
    cypher_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo"),
    qa_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo-16k"),
    verbose=True,
)
```

```python
chain.invoke({"query": "Who played in Top Gun?"})
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'a.name': 'Anthony Edwards'}, {'a.name': 'Meg Ryan'}, {'a.name': 'Val Kilmer'}, {'a.name': 'Tom Cruise'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Anthony Edwards, Meg Ryan, Val Kilmer, and Tom Cruise played in Top Gun.'}
```

## ì§€ì •ëœ ë…¸ë“œ ë° ê´€ê³„ ìœ í˜• ë¬´ì‹œ

`include_types` ë˜ëŠ” `exclude_types`ë¥¼ ì‚¬ìš©í•˜ì—¬ Cypher ë¬¸ ìƒì„± ì‹œ ê·¸ë˜í”„ ìŠ¤í‚¤ë§ˆì˜ ì¼ë¶€ë¥¼ ë¬´ì‹œí•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
chain = GraphCypherQAChain.from_llm(
    graph=graph,
    cypher_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo"),
    qa_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo-16k"),
    verbose=True,
    exclude_types=["Movie"],
)
```

```python
# Inspect graph schema
print(chain.graph_schema)
```

```output
Node properties are the following:
Actor {name: STRING}
Relationship properties are the following:

The relationships are the following:
```

## ìƒì„±ëœ Cypher ë¬¸ ê²€ì¦

`validate_cypher` ë§¤ê°œë³€ìˆ˜ë¥¼ ì‚¬ìš©í•˜ì—¬ ìƒì„±ëœ Cypher ë¬¸ì„ ê²€ì¦í•˜ê³  ê´€ê³„ ë°©í–¥ì„ ìˆ˜ì •í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
chain = GraphCypherQAChain.from_llm(
    llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo"),
    graph=graph,
    verbose=True,
    validate_cypher=True,
)
```

```python
chain.invoke({"query": "Who played in Top Gun?"})
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'a.name': 'Anthony Edwards'}, {'a.name': 'Meg Ryan'}, {'a.name': 'Val Kilmer'}, {'a.name': 'Tom Cruise'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Anthony Edwards, Meg Ryan, Val Kilmer, Tom Cruise played in Top Gun.'}
```
