---
translated: true
---

---
ì–´ë–¤ ê²½ìš°ë“ , ì˜¨í†¨ë¡œì§€(ìŠ¤í‚¤ë§ˆ)ëŠ” ì ì ˆí•œ ì ‘ë‘ì‚¬ì™€ í•¨ê»˜ ê°€ì¥ ê°„ë‹¨í•˜ê³  LLMì´ ê¸°ì–µí•˜ê¸° ì‰¬ìš´ `Turtle` í˜•ì‹ìœ¼ë¡œ LLMì— ì œê³µë©ë‹ˆë‹¤.

ìŠ¤íƒ€ì›Œì¦ˆ ì˜¨í†¨ë¡œì§€ëŠ” í´ë˜ìŠ¤ì— ëŒ€í•œ ë§ì€ íŠ¹ì • íŠ¸ë¦¬í”Œì„ í¬í•¨í•˜ê³  ìˆë‹¤ëŠ” ì ì—ì„œ ì•½ê°„ íŠ¹ì´í•©ë‹ˆë‹¤. ì˜ˆë¥¼ ë“¤ì–´ `:Aleena` ì¢…ì€ `<planet/38>`ì— ì‚´ê³ , `:Reptile`ì˜ í•˜ìœ„ í´ë˜ìŠ¤ì´ë©°, íŠ¹ì • íŠ¹ì„±(í‰ê·  í‚¤, í‰ê·  ìˆ˜ëª…, í”¼ë¶€ìƒ‰)ì„ ê°€ì§€ê³  ìˆê³ , íŠ¹ì • ê°œì²´(ìºë¦­í„°)ê°€ ê·¸ í´ë˜ìŠ¤ì˜ ëŒ€í‘œìì…ë‹ˆë‹¤.

```output
@prefix : <https://swapi.co/vocabulary/> .
@prefix owl: <http://www.w3.org/2002/07/owl#> .
@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .

:Aleena a owl:Class, :Species ;
    rdfs:label "Aleena" ;
    rdfs:isDefinedBy <https://swapi.co/ontology/> ;
    rdfs:subClassOf :Reptile, :Sentient ;
    :averageHeight 80.0 ;
    :averageLifespan "79" ;
    :character <https://swapi.co/resource/aleena/47> ;
    :film <https://swapi.co/resource/film/4> ;
    :language "Aleena" ;
    :planet <https://swapi.co/resource/planet/38> ;
    :skinColor "blue", "gray" .

    ...

```

ì´ íŠœí† ë¦¬ì–¼ì„ ë‹¨ìˆœí•˜ê²Œ ìœ ì§€í•˜ê¸° ìœ„í•´ ë³´ì•ˆë˜ì§€ ì•Šì€ GraphDBë¥¼ ì‚¬ìš©í•©ë‹ˆë‹¤. GraphDBê°€ ë³´ì•ˆë˜ì–´ ìˆëŠ” ê²½ìš° `OntotextGraphDBGraph`ë¥¼ ì´ˆê¸°í™”í•˜ê¸° ì „ì— 'GRAPHDB_USERNAME'ê³¼ 'GRAPHDB_PASSWORD' í™˜ê²½ ë³€ìˆ˜ë¥¼ ì„¤ì •í•´ì•¼ í•©ë‹ˆë‹¤.

```python
os.environ["GRAPHDB_USERNAME"] = "graphdb-user"
os.environ["GRAPHDB_PASSWORD"] = "graphdb-password"

graph = OntotextGraphDBGraph(
    query_endpoint=...,
    query_ontology=...
)
```

## StarWars ë°ì´í„°ì…‹ì— ëŒ€í•œ ì§ˆë¬¸ ë‹µë³€

ì´ì œ `OntotextGraphDBQAChain`ì„ ì‚¬ìš©í•˜ì—¬ ëª‡ ê°€ì§€ ì§ˆë¬¸ì„ í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
import os

from langchain.chains import OntotextGraphDBQAChain
from langchain_openai import ChatOpenAI

# We'll be using an OpenAI model which requires an OpenAI API Key.
# However, other models are available as well:
# https://python.langchain.com/docs/integrations/chat/

# Set the environment variable `OPENAI_API_KEY` to your OpenAI API key
os.environ["OPENAI_API_KEY"] = "sk-***"

# Any available OpenAI model can be used here.
# We use 'gpt-4-1106-preview' because of the bigger context window.
# The 'gpt-4-1106-preview' model_name will deprecate in the future and will change to 'gpt-4-turbo' or similar,
# so be sure to consult with the OpenAI API https://platform.openai.com/docs/models for the correct naming.

chain = OntotextGraphDBQAChain.from_llm(
    ChatOpenAI(temperature=0, model_name="gpt-4-1106-preview"),
    graph=graph,
    verbose=True,
)
```

ê°„ë‹¨í•œ ì§ˆë¬¸ì„ í•´ë³´ê² ìŠµë‹ˆë‹¤.

```python
chain.invoke({chain.input_key: "What is the climate on Tatooine?"})[chain.output_key]
```

```output


[1m> Entering new OntotextGraphDBQAChain chain...[0m
Generated SPARQL:
[32;1m[1;3mPREFIX : <https://swapi.co/vocabulary/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>

SELECT ?climate
WHERE {
  ?planet rdfs:label "Tatooine" ;
          :climate ?climate .
}[0m

[1m> Finished chain.[0m
```

```output
'The climate on Tatooine is arid.'
```

ê·¸ë¦¬ê³  ì¢€ ë” ë³µì¡í•œ ì§ˆë¬¸ì„ í•´ë³´ê² ìŠµë‹ˆë‹¤.

```python
chain.invoke({chain.input_key: "What is the climate on Luke Skywalker's home planet?"})[
    chain.output_key
]
```

```output


[1m> Entering new OntotextGraphDBQAChain chain...[0m
Generated SPARQL:
[32;1m[1;3mPREFIX : <https://swapi.co/vocabulary/>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>

SELECT ?climate
WHERE {
  ?character rdfs:label "Luke Skywalker" .
  ?character :homeworld ?planet .
  ?planet :climate ?climate .
}[0m

[1m> Finished chain.[0m
```

```output
"The climate on Luke Skywalker's home planet is arid."
```

ë” ë³µì¡í•œ ì§ˆë¬¸ë„ í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
chain.invoke(
    {
        chain.input_key: "What is the average box office revenue for all the Star Wars movies?"
    }
)[chain.output_key]
```

```output


[1m> Entering new OntotextGraphDBQAChain chain...[0m
Generated SPARQL:
[32;1m[1;3mPREFIX : <https://swapi.co/vocabulary/>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>

SELECT (AVG(?boxOffice) AS ?averageBoxOffice)
WHERE {
  ?film a :Film .
  ?film :boxOffice ?boxOfficeValue .
  BIND(xsd:decimal(?boxOfficeValue) AS ?boxOffice)
}
[0m

[1m> Finished chain.[0m
```

```output
'The average box office revenue for all the Star Wars movies is approximately 754.1 million dollars.'
```

## ì²´ì¸ ìˆ˜ì •ì

Ontotext GraphDB QA ì²´ì¸ì€ í”„ë¡¬í”„íŠ¸ ì •ì œë¥¼ í†µí•´ QA ì²´ì¸ì„ ë” ê°œì„ í•˜ê³  ì•±ì˜ ì „ë°˜ì ì¸ ì‚¬ìš©ì ê²½í—˜ì„ í–¥ìƒì‹œí‚¬ ìˆ˜ ìˆìŠµë‹ˆë‹¤.

### "SPARQL ìƒì„±" í”„ë¡¬í”„íŠ¸

ì´ í”„ë¡¬í”„íŠ¸ëŠ” ì‚¬ìš©ì ì§ˆë¬¸ê³¼ KG ìŠ¤í‚¤ë§ˆë¥¼ ê¸°ë°˜ìœ¼ë¡œ SPARQL ì¿¼ë¦¬ë¥¼ ìƒì„±í•˜ëŠ” ë° ì‚¬ìš©ë©ë‹ˆë‹¤.

- `sparql_generation_prompt`

    ê¸°ë³¸ê°’:

```python
  GRAPHDB_SPARQL_GENERATION_TEMPLATE = """
  Write a SPARQL SELECT query for querying a graph database.
  The ontology schema delimited by triple backticks in Turtle format is:
    ```
    {schema}
    ```
  Use only the classes and properties provided in the schema to construct the SPARQL query.
  Do not use any classes or properties that are not explicitly provided in the SPARQL query.
  Include all necessary prefixes.
  Do not include any explanations or apologies in your responses.
  Do not wrap the query in backticks.
  Do not include any text except the SPARQL query generated.
  The question delimited by triple backticks is:
    ```
    {prompt}
    ```
  """
  GRAPHDB_SPARQL_GENERATION_PROMPT = PromptTemplate(
      input_variables=["schema", "prompt"],
      template=GRAPHDB_SPARQL_GENERATION_TEMPLATE,
  )
```

### "SPARQL ìˆ˜ì •" í”„ë¡¬í”„íŠ¸

ë•Œë•Œë¡œ LLMì´ êµ¬ë¬¸ ì˜¤ë¥˜ë‚˜ ì ‘ë‘ì‚¬ ëˆ„ë½ ë“±ì´ ìˆëŠ” SPARQL ì¿¼ë¦¬ë¥¼ ìƒì„±í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤. ì²´ì¸ì€ LLMì—ê²Œ ì´ë¥¼ ìˆ˜ì •í•˜ë„ë¡ í”„ë¡¬í”„íŒ…í•˜ì—¬ ì¼ì • íšŸìˆ˜ ë™ì•ˆ ìˆ˜ì •ì„ ì‹œë„í•©ë‹ˆë‹¤.

- `sparql_fix_prompt`

    ê¸°ë³¸ê°’:

```python
  GRAPHDB_SPARQL_FIX_TEMPLATE = """
  This following SPARQL query delimited by triple backticks
    ```
    {generated_sparql}
    ```
  is not valid.
  The error delimited by triple backticks is
    ```
    {error_message}
    ```
  Give me a correct version of the SPARQL query.
  Do not change the logic of the query.
  Do not include any explanations or apologies in your responses.
  Do not wrap the query in backticks.
  Do not include any text except the SPARQL query generated.
  The ontology schema delimited by triple backticks in Turtle format is:
    ```
    {schema}
    ```
  """

  GRAPHDB_SPARQL_FIX_PROMPT = PromptTemplate(
      input_variables=["error_message", "generated_sparql", "schema"],
      template=GRAPHDB_SPARQL_FIX_TEMPLATE,
  )
```

- `max_fix_retries`

    ê¸°ë³¸ê°’: `5`

### "ë‹µë³€" í”„ë¡¬í”„íŠ¸

ì´ í”„ë¡¬í”„íŠ¸ëŠ” ë°ì´í„°ë² ì´ìŠ¤ì—ì„œ ë°˜í™˜ëœ ê²°ê³¼ì™€ ì´ˆê¸° ì‚¬ìš©ì ì§ˆë¬¸ì„ ê¸°ë°˜ìœ¼ë¡œ ì§ˆë¬¸ì— ë‹µë³€í•˜ëŠ” ë° ì‚¬ìš©ë©ë‹ˆë‹¤. ê¸°ë³¸ì ìœ¼ë¡œ LLMì€ ë°˜í™˜ëœ ê²°ê³¼ ì •ë³´ë§Œ ì‚¬ìš©í•˜ë„ë¡ ì§€ì‹œë©ë‹ˆë‹¤. ê²°ê³¼ ì§‘í•©ì´ ë¹„ì–´ ìˆëŠ” ê²½ìš° LLMì€ ì§ˆë¬¸ì— ë‹µë³€í•  ìˆ˜ ì—†ìŒì„ ì•Œë ¤ì•¼ í•©ë‹ˆë‹¤.

- `qa_prompt`

  ê¸°ë³¸ê°’:

```python
  GRAPHDB_QA_TEMPLATE = """Task: Generate a natural language response from the results of a SPARQL query.
  You are an assistant that creates well-written and human understandable answers.
  The information part contains the information provided, which you can use to construct an answer.
  The information provided is authoritative, you must never doubt it or try to use your internal knowledge to correct it.
  Make your response sound like the information is coming from an AI assistant, but don't add any information.
  Don't use internal knowledge to answer the question, just say you don't know if no information is available.
  Information:
  {context}

  Question: {prompt}
  Helpful Answer:"""
  GRAPHDB_QA_PROMPT = PromptTemplate(
      input_variables=["context", "prompt"], template=GRAPHDB_QA_TEMPLATE
  )
```

GraphDBë¡œ QA ì‘ì—…ì„ ë§ˆì¹˜ë©´ Docker í™˜ê²½ì„ ì¢…ë£Œí•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```shell
docker compose down -v --remove-orphans
```

Docker êµ¬ì„± íŒŒì¼ì´ ìˆëŠ” ë””ë ‰í† ë¦¬ì—ì„œ ì‹¤í–‰í•˜ë©´ ë©ë‹ˆë‹¤.
