---
translated: true
---

# RDFLib

>[RDFLib](https://rdflib.readthedocs.io/)ëŠ” RDF(Resource Description Framework)ë¥¼ ë‹¤ë£¨ê¸° ìœ„í•œ ìˆœìˆ˜ Python íŒ¨í‚¤ì§€ì…ë‹ˆë‹¤. `RDFLib`ì—ëŠ” RDFë¥¼ ë‹¤ë£¨ëŠ” ë° í•„ìš”í•œ ëŒ€ë¶€ë¶„ì˜ ê²ƒë“¤ì´ í¬í•¨ë˜ì–´ ìˆìŠµë‹ˆë‹¤:
>- RDF/XML, N3, NTriples, N-Quads, Turtle, TriX, Trig ë° JSON-LDì˜ íŒŒì„œì™€ ì§ë ¬í™”ê¸°
>- ë‹¤ì–‘í•œ Store êµ¬í˜„ìœ¼ë¡œ ì§€ì›ë˜ëŠ” Graph ì¸í„°í˜ì´ìŠ¤
>- ë©”ëª¨ë¦¬ ë‚´, ë””ìŠ¤í¬ ìƒì˜ ì˜êµ¬ ì €ì¥(Berkeley DB) ë° ì›ê²© SPARQL ì—”ë“œí¬ì¸íŠ¸ì— ëŒ€í•œ ì €ì¥ì†Œ êµ¬í˜„
>- SPARQL 1.1 êµ¬í˜„ - SPARQL 1.1 ì¿¼ë¦¬ ë° ì—…ë°ì´íŠ¸ ë¬¸ ì§€ì›
>- SPARQL í•¨ìˆ˜ í™•ì¥ ë©”ì»¤ë‹ˆì¦˜

ê·¸ë˜í”„ ë°ì´í„°ë² ì´ìŠ¤ëŠ” ë„¤íŠ¸ì›Œí¬ ëª¨ë¸ ê¸°ë°˜ ì• í”Œë¦¬ì¼€ì´ì…˜ì— ë§¤ìš° ì í•©í•œ ì„ íƒì…ë‹ˆë‹¤. ì´ëŸ¬í•œ ê·¸ë˜í”„ì˜ êµ¬ë¬¸ê³¼ ì˜ë¯¸ë¥¼ í‘œì¤€í™”í•˜ê¸° ìœ„í•´ W3CëŠ” ì‹œë§¨í‹± ì›¹ ê¸°ìˆ ì„ ê¶Œì¥í•©ë‹ˆë‹¤.

[SPARQL](https://www.w3.org/TR/sparql11-query/)ì€ SQLì´ë‚˜ Cypherì™€ ìœ ì‚¬í•˜ê²Œ ì´ëŸ¬í•œ ê·¸ë˜í”„ì— ëŒ€í•œ ì¿¼ë¦¬ ì–¸ì–´ë¡œ ì‚¬ìš©ë©ë‹ˆë‹¤. ì´ ë…¸íŠ¸ë¶ì€ LLMì„ ì‚¬ìš©í•˜ì—¬ ê·¸ë˜í”„ ë°ì´í„°ë² ì´ìŠ¤ì— ëŒ€í•œ ìì—°ì–´ ì¸í„°í˜ì´ìŠ¤ë¥¼ ìƒì„±í•˜ëŠ” SPARQL ì ìš©ì„ ë³´ì—¬ì¤ë‹ˆë‹¤.

**ì£¼ì˜:** í˜„ì¬ LLMì„ í†µí•œ SPARQL ì¿¼ë¦¬ ìƒì„±ì€ ì•„ì§ ë‹¤ì†Œ ë¶ˆì•ˆì •í•©ë‹ˆë‹¤. ê·¸ë˜í”„ë¥¼ ë³€ê²½í•˜ëŠ” UPDATE ì¿¼ë¦¬ì— íŠ¹íˆ ì£¼ì˜í•´ì•¼ í•©ë‹ˆë‹¤.

## ì„¤ì •

Python ë¼ì´ë¸ŒëŸ¬ë¦¬ë¥¼ ì„¤ì¹˜í•´ì•¼ í•©ë‹ˆë‹¤:

```python
!pip install rdflib
```

ì¿¼ë¦¬ë¥¼ ì‹¤í–‰í•  ìˆ˜ ìˆëŠ” ì†ŒìŠ¤ì—ëŠ” ì›¹ìƒì˜ íŒŒì¼, ë¡œì»¬ì— ìˆëŠ” íŒŒì¼, SPARQL ì—”ë“œí¬ì¸íŠ¸(ì˜ˆ: [Wikidata](https://www.wikidata.org/wiki/Wikidata:Main_Page)), ê·¸ë¦¬ê³  [triple store](https://www.w3.org/wiki/LargeTripleStores)ê°€ ìˆìŠµë‹ˆë‹¤.

```python
from langchain.chains import GraphSparqlQAChain
from langchain_community.graphs import RdfGraph
from langchain_openai import ChatOpenAI
```

```python
graph = RdfGraph(
    source_file="http://www.w3.org/People/Berners-Lee/card",
    standard="rdf",
    local_copy="test.ttl",
)
```

ì†ŒìŠ¤ê°€ ì½ê¸° ì „ìš©ì¸ ê²½ìš° `local_file`ì„ ì œê³µí•˜ì—¬ ë³€ê²½ ì‚¬í•­ì„ ë¡œì»¬ì— ì €ì¥í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

## ê·¸ë˜í”„ ìŠ¤í‚¤ë§ˆ ì •ë³´ ìƒˆë¡œ ê³ ì¹¨

ë°ì´í„°ë² ì´ìŠ¤ ìŠ¤í‚¤ë§ˆê°€ ë³€ê²½ë˜ë©´ SPARQL ì¿¼ë¦¬ ìƒì„±ì— í•„ìš”í•œ ìŠ¤í‚¤ë§ˆ ì •ë³´ë¥¼ ìƒˆë¡œ ê³ ì¹  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
graph.load_schema()
```

```python
graph.get_schema
```

```output
In the following, each IRI is followed by the local name and optionally its description in parentheses.
The RDF graph supports the following node types:
<http://xmlns.com/foaf/0.1/PersonalProfileDocument> (PersonalProfileDocument, None), <http://www.w3.org/ns/auth/cert#RSAPublicKey> (RSAPublicKey, None), <http://www.w3.org/2000/10/swap/pim/contact#Male> (Male, None), <http://xmlns.com/foaf/0.1/Person> (Person, None), <http://www.w3.org/2006/vcard/ns#Work> (Work, None)
The RDF graph supports the following relationships:
<http://www.w3.org/2000/01/rdf-schema#seeAlso> (seeAlso, None), <http://purl.org/dc/elements/1.1/title> (title, None), <http://xmlns.com/foaf/0.1/mbox_sha1sum> (mbox_sha1sum, None), <http://xmlns.com/foaf/0.1/maker> (maker, None), <http://www.w3.org/ns/solid/terms#oidcIssuer> (oidcIssuer, None), <http://www.w3.org/2000/10/swap/pim/contact#publicHomePage> (publicHomePage, None), <http://xmlns.com/foaf/0.1/openid> (openid, None), <http://www.w3.org/ns/pim/space#storage> (storage, None), <http://xmlns.com/foaf/0.1/name> (name, None), <http://www.w3.org/2000/10/swap/pim/contact#country> (country, None), <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> (type, None), <http://www.w3.org/ns/solid/terms#profileHighlightColor> (profileHighlightColor, None), <http://www.w3.org/ns/pim/space#preferencesFile> (preferencesFile, None), <http://www.w3.org/2000/01/rdf-schema#label> (label, None), <http://www.w3.org/ns/auth/cert#modulus> (modulus, None), <http://www.w3.org/2000/10/swap/pim/contact#participant> (participant, None), <http://www.w3.org/2000/10/swap/pim/contact#street2> (street2, None), <http://www.w3.org/2006/vcard/ns#locality> (locality, None), <http://xmlns.com/foaf/0.1/nick> (nick, None), <http://xmlns.com/foaf/0.1/homepage> (homepage, None), <http://creativecommons.org/ns#license> (license, None), <http://xmlns.com/foaf/0.1/givenname> (givenname, None), <http://www.w3.org/2006/vcard/ns#street-address> (street-address, None), <http://www.w3.org/2006/vcard/ns#postal-code> (postal-code, None), <http://www.w3.org/2000/10/swap/pim/contact#street> (street, None), <http://www.w3.org/2003/01/geo/wgs84_pos#lat> (lat, None), <http://xmlns.com/foaf/0.1/primaryTopic> (primaryTopic, None), <http://www.w3.org/2006/vcard/ns#fn> (fn, None), <http://www.w3.org/2003/01/geo/wgs84_pos#location> (location, None), <http://usefulinc.com/ns/doap#developer> (developer, None), <http://www.w3.org/2000/10/swap/pim/contact#city> (city, None), <http://www.w3.org/2006/vcard/ns#region> (region, None), <http://xmlns.com/foaf/0.1/member> (member, None), <http://www.w3.org/2003/01/geo/wgs84_pos#long> (long, None), <http://www.w3.org/2000/10/swap/pim/contact#address> (address, None), <http://xmlns.com/foaf/0.1/family_name> (family_name, None), <http://xmlns.com/foaf/0.1/account> (account, None), <http://xmlns.com/foaf/0.1/workplaceHomepage> (workplaceHomepage, None), <http://purl.org/dc/terms/title> (title, None), <http://www.w3.org/ns/solid/terms#publicTypeIndex> (publicTypeIndex, None), <http://www.w3.org/2000/10/swap/pim/contact#office> (office, None), <http://www.w3.org/2000/10/swap/pim/contact#homePage> (homePage, None), <http://xmlns.com/foaf/0.1/mbox> (mbox, None), <http://www.w3.org/2000/10/swap/pim/contact#preferredURI> (preferredURI, None), <http://www.w3.org/ns/solid/terms#profileBackgroundColor> (profileBackgroundColor, None), <http://schema.org/owns> (owns, None), <http://xmlns.com/foaf/0.1/based_near> (based_near, None), <http://www.w3.org/2006/vcard/ns#hasAddress> (hasAddress, None), <http://xmlns.com/foaf/0.1/img> (img, None), <http://www.w3.org/2000/10/swap/pim/contact#assistant> (assistant, None), <http://xmlns.com/foaf/0.1/title> (title, None), <http://www.w3.org/ns/auth/cert#key> (key, None), <http://www.w3.org/ns/ldp#inbox> (inbox, None), <http://www.w3.org/ns/solid/terms#editableProfile> (editableProfile, None), <http://www.w3.org/2000/10/swap/pim/contact#postalCode> (postalCode, None), <http://xmlns.com/foaf/0.1/weblog> (weblog, None), <http://www.w3.org/ns/auth/cert#exponent> (exponent, None), <http://rdfs.org/sioc/ns#avatar> (avatar, None)
```

## ê·¸ë˜í”„ ì¿¼ë¦¬

ì´ì œ ê·¸ë˜í”„ SPARQL QA ì²´ì¸ì„ ì‚¬ìš©í•˜ì—¬ ê·¸ë˜í”„ì— ëŒ€í•œ ì§ˆë¬¸ì„ í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
chain = GraphSparqlQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True
)
```

```python
chain.run("What is Tim Berners-Lee's work homepage?")
```

```output


[1m> Entering new GraphSparqlQAChain chain...[0m
Identified intent:
[32;1m[1;3mSELECT[0m
Generated SPARQL:
[32;1m[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?homepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?homepage .
}[0m
Full Context:
[32;1m[1;3m[][0m

[1m> Finished chain.[0m
```

```output
"Tim Berners-Lee's work homepage is http://www.w3.org/People/Berners-Lee/."
```

## ê·¸ë˜í”„ ì—…ë°ì´íŠ¸

ë§ˆì°¬ê°€ì§€ë¡œ ìì—°ì–´ë¥¼ ì‚¬ìš©í•˜ì—¬ ê·¸ë˜í”„ë¥¼ ì—…ë°ì´íŠ¸í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤(ì˜ˆ: íŠ¸ë¦¬í”Œ ì‚½ì…).

```python
chain.run(
    "Save that the person with the name 'Timothy Berners-Lee' has a work homepage at 'http://www.w3.org/foo/bar/'"
)
```

```output


[1m> Entering new GraphSparqlQAChain chain...[0m
Identified intent:
[32;1m[1;3mUPDATE[0m
Generated SPARQL:
[32;1m[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>
INSERT {
    ?person foaf:workplaceHomepage <http://www.w3.org/foo/bar/> .
}
WHERE {
    ?person foaf:name "Timothy Berners-Lee" .
}[0m

[1m> Finished chain.[0m
```

```output
'Successfully inserted triples into the graph.'
```

ê²°ê³¼ë¥¼ í™•ì¸í•´ ë³´ê² ìŠµë‹ˆë‹¤:

```python
query = (
    """PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n"""
    """SELECT ?hp\n"""
    """WHERE {\n"""
    """    ?person foaf:name "Timothy Berners-Lee" . \n"""
    """    ?person foaf:workplaceHomepage ?hp .\n"""
    """}"""
)
graph.query(query)
```

```output
[(rdflib.term.URIRef('https://www.w3.org/'),),
 (rdflib.term.URIRef('http://www.w3.org/foo/bar/'),)]
```

## SPARQL ì¿¼ë¦¬ ë°˜í™˜

`return_sparql_query` ë§¤ê°œë³€ìˆ˜ë¥¼ ì‚¬ìš©í•˜ì—¬ Sparql QA ì²´ì¸ì˜ SPARQL ì¿¼ë¦¬ ë‹¨ê³„ë¥¼ ë°˜í™˜í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```python
chain = GraphSparqlQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, return_sparql_query=True
)
```

```python
result = chain("What is Tim Berners-Lee's work homepage?")
print(f"SQARQL query: {result['sparql_query']}")
print(f"Final answer: {result['result']}")
```

```output


[1m> Entering new GraphSparqlQAChain chain...[0m
Identified intent:
[32;1m[1;3mSELECT[0m
Generated SPARQL:
[32;1m[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?workHomepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?workHomepage .
}[0m
Full Context:
[32;1m[1;3m[][0m

[1m> Finished chain.[0m
SQARQL query: PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?workHomepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?workHomepage .
}
Final answer: Tim Berners-Lee's work homepage is http://www.w3.org/People/Berners-Lee/.
```

```python
print(result["sparql_query"])
```

```output
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?workHomepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?workHomepage .
}
```
