---
translated: true
---

# Apache AGE

>[Apache AGE](https://age.apache.org/)ã¯ã€ã‚°ãƒ©ãƒ•ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹æ©Ÿèƒ½ã‚’æä¾›ã™ã‚‹PostgreSQLã®æ‹¡å¼µæ©Ÿèƒ½ã§ã™ã€‚AGEã¯A Graph Extensionã®ç•¥ã§ã€PostgreSQL 10ã®Bitnineã®ãƒ•ã‚©ãƒ¼ã‚¯ã§ã‚ã‚‹AgensGraphã«è§¦ç™ºã•ã‚ŒãŸã‚‚ã®ã§ã™ã€‚ã“ã®ãƒ—ãƒ­ã‚¸ã‚§ã‚¯ãƒˆã®ç›®çš„ã¯ã€ãƒªãƒ¬ãƒ¼ã‚·ãƒ§ãƒŠãƒ«ãƒ¢ãƒ‡ãƒ«ã¨ã‚°ãƒ©ãƒ•ãƒ¢ãƒ‡ãƒ«ã®ãƒ‡ãƒ¼ã‚¿ã‚’å˜ä¸€ã®ã‚¹ãƒˆãƒ¬ãƒ¼ã‚¸ã§å‡¦ç†ã§ãã‚‹ã‚ˆã†ã«ã™ã‚‹ã“ã¨ã§ã€ãƒ¦ãƒ¼ã‚¶ãƒ¼ãŒæ¨™æº–ã®ANSI SQLã¨ã‚ªãƒ¼ãƒ—ãƒ³Cypherã®ã‚°ãƒ©ãƒ•ã‚¯ã‚¨ãƒªè¨€èªã‚’ä½¿ç”¨ã§ãã‚‹ã‚ˆã†ã«ã™ã‚‹ã“ã¨ã§ã™ã€‚ `Apache AGE`ãŒä¿å­˜ã™ã‚‹ãƒ‡ãƒ¼ã‚¿è¦ç´ ã¯ã€ãƒãƒ¼ãƒ‰ã€ãã‚Œã‚‰ã‚’æ¥ç¶šã™ã‚‹ã‚¨ãƒƒã‚¸ã€ãŠã‚ˆã³ãƒãƒ¼ãƒ‰ã¨ã‚¨ãƒƒã‚¸ã®å±æ€§ã§ã™ã€‚

>ã“ã®ãƒãƒ¼ãƒˆãƒ–ãƒƒã‚¯ã§ã¯ã€LLMã‚’ä½¿ç”¨ã—ã¦ã‚°ãƒ©ãƒ•ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã«è‡ªç„¶è¨€èªã‚¤ãƒ³ã‚¿ãƒ¼ãƒ•ã‚§ã‚¤ã‚¹ã‚’æä¾›ã—ã€`Cypher`ã‚¯ã‚¨ãƒªè¨€èªã§ã‚¯ã‚¨ãƒªã™ã‚‹æ–¹æ³•ã‚’ç¤ºã—ã¾ã™ã€‚

>[Cypher](https://en.wikipedia.org/wiki/Cypher_(query_language))ã¯ã€ãƒ—ãƒ­ãƒ‘ãƒ†ã‚£ã‚°ãƒ©ãƒ•ã§ã®è¡¨ç¾åŠ›ã®é«˜ãåŠ¹ç‡çš„ãªãƒ‡ãƒ¼ã‚¿ã‚¯ã‚¨ãƒªã‚’å¯èƒ½ã«ã™ã‚‹å®£è¨€å‹ã®ã‚°ãƒ©ãƒ•ã‚¯ã‚¨ãƒªè¨€èªã§ã™ã€‚

## è¨­å®š

`Postgre`ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã‚’å®Ÿè¡Œã—ã€AGEæ‹¡å¼µæ©Ÿèƒ½ã‚’ã‚¤ãƒ³ã‚¹ãƒˆãƒ¼ãƒ«ã™ã‚‹å¿…è¦ãŒã‚ã‚Šã¾ã™ã€‚ãƒ†ã‚¹ãƒˆã™ã‚‹ãŸã‚ã®ã‚ªãƒ—ã‚·ãƒ§ãƒ³ã®1ã¤ã¯ã€å…¬å¼ã®AGEãƒ‰ãƒƒã‚«ãƒ¼ ã‚¤ãƒ¡ãƒ¼ã‚¸ã‚’ä½¿ç”¨ã—ã¦ãƒ‰ãƒƒã‚«ãƒ¼ ã‚³ãƒ³ãƒ†ãƒŠã‚’å®Ÿè¡Œã™ã‚‹ã“ã¨ã§ã™ã€‚
æ¬¡ã®ã‚¹ã‚¯ãƒªãƒ—ãƒˆã‚’å®Ÿè¡Œã—ã¦ãƒ­ãƒ¼ã‚«ãƒ«ã®ãƒ‰ãƒƒã‚«ãƒ¼ ã‚³ãƒ³ãƒ†ãƒŠã‚’å®Ÿè¡Œã§ãã¾ã™:

```bash
docker run \
    --name age  \
    -p 5432:5432 \
    -e POSTGRES_USER=postgresUser \
    -e POSTGRES_PASSWORD=postgresPW \
    -e POSTGRES_DB=postgresDB \
    -d \
    apache/age
```

ãƒ‰ãƒƒã‚«ãƒ¼ã§ã®å®Ÿè¡Œã«é–¢ã™ã‚‹è¿½åŠ ã®èª¬æ˜ã¯[ã“ã¡ã‚‰](https://hub.docker.com/r/apache/age)ã«ã‚ã‚Šã¾ã™ã€‚

```python
from langchain.chains import GraphCypherQAChain
from langchain_community.graphs.age_graph import AGEGraph
from langchain_openai import ChatOpenAI
```

```python
conf = {
    "database": "postgresDB",
    "user": "postgresUser",
    "password": "postgresPW",
    "host": "localhost",
    "port": 5432,
}

graph = AGEGraph(graph_name="age_test", conf=conf)
```

## ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã®åˆæœŸåŒ–

ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ãŒç©ºã®å ´åˆã€Cypherã‚¯ã‚¨ãƒªè¨€èªã‚’ä½¿ç”¨ã—ã¦åˆæœŸåŒ–ã§ãã¾ã™ã€‚æ¬¡ã®Cypherã‚¹ãƒ†ãƒ¼ãƒˆãƒ¡ãƒ³ãƒˆã¯å†ªç­‰æ€§ãŒã‚ã‚Šã€1å›ã¾ãŸã¯è¤‡æ•°å›å®Ÿè¡Œã—ã¦ã‚‚ã€ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã®æƒ…å ±ã¯åŒã˜ã«ãªã‚Šã¾ã™ã€‚

```python
graph.query(
    """
MERGE (m:Movie {name:"Top Gun"})
WITH m
UNWIND ["Tom Cruise", "Val Kilmer", "Anthony Edwards", "Meg Ryan"] AS actor
MERGE (a:Actor {name:actor})
MERGE (a)-[:ACTED_IN]->(m)
"""
)
```

```output
[]
```

## ã‚°ãƒ©ãƒ•ã‚¹ã‚­ãƒ¼ãƒæƒ…å ±ã®æ›´æ–°

ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã®ã‚¹ã‚­ãƒ¼ãƒãŒå¤‰æ›´ã•ã‚ŒãŸå ´åˆã¯ã€Cypherã‚¹ãƒ†ãƒ¼ãƒˆãƒ¡ãƒ³ãƒˆã‚’ç”Ÿæˆã™ã‚‹ãŸã‚ã«å¿…è¦ãªã‚¹ã‚­ãƒ¼ãƒæƒ…å ±ã‚’æ›´æ–°ã§ãã¾ã™ã€‚

```python
graph.refresh_schema()
```

```python
print(graph.schema)
```

```output

        Node properties are the following:
        [{'properties': [{'property': 'name', 'type': 'STRING'}], 'labels': 'Actor'}, {'properties': [{'property': 'property_a', 'type': 'STRING'}], 'labels': 'LabelA'}, {'properties': [], 'labels': 'LabelB'}, {'properties': [], 'labels': 'LabelC'}, {'properties': [{'property': 'name', 'type': 'STRING'}], 'labels': 'Movie'}]
        Relationship properties are the following:
        [{'properties': [], 'type': 'ACTED_IN'}, {'properties': [{'property': 'rel_prop', 'type': 'STRING'}], 'type': 'REL_TYPE'}]
        The relationships are the following:
        ['(:`Actor`)-[:`ACTED_IN`]->(:`Movie`)', '(:`LabelA`)-[:`REL_TYPE`]->(:`LabelB`)', '(:`LabelA`)-[:`REL_TYPE`]->(:`LabelC`)']
```

## ã‚°ãƒ©ãƒ•ã®ã‚¯ã‚¨ãƒª

ã‚°ãƒ©ãƒ•CypherQAãƒã‚§ãƒ¼ãƒ³ã‚’ä½¿ç”¨ã—ã¦ã€ã‚°ãƒ©ãƒ•ã«è³ªå•ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True
)
```

```python
chain.invoke("Who played in Top Gun?")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m

Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'name': 'Tom Cruise'}, {'name': 'Val Kilmer'}, {'name': 'Anthony Edwards'}, {'name': 'Meg Ryan'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Tom Cruise, Val Kilmer, Anthony Edwards, Meg Ryan played in Top Gun.'}
```

## çµæœã®æ•°ã‚’åˆ¶é™ã™ã‚‹

`top_k`ãƒ‘ãƒ©ãƒ¡ãƒ¼ã‚¿ãƒ¼ã‚’ä½¿ç”¨ã—ã¦ã€Cypher QAãƒã‚§ãƒ¼ãƒ³ã‹ã‚‰ã®çµæœã®æ•°ã‚’åˆ¶é™ã§ãã¾ã™ã€‚
ãƒ‡ãƒ•ã‚©ãƒ«ãƒˆã¯10ã§ã™ã€‚

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, top_k=2
)
```

```python
chain.invoke("Who played in Top Gun?")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie {name: 'Top Gun'})
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'name': 'Tom Cruise'}, {'name': 'Val Kilmer'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Tom Cruise, Val Kilmer played in Top Gun.'}
```

## ä¸­é–“çµæœã‚’è¿”ã™

`return_intermediate_steps`ãƒ‘ãƒ©ãƒ¡ãƒ¼ã‚¿ãƒ¼ã‚’ä½¿ç”¨ã—ã¦ã€Cypher QAãƒã‚§ãƒ¼ãƒ³ã‹ã‚‰ã®ä¸­é–“ã‚¹ãƒ†ãƒƒãƒ—ã‚’è¿”ã™ã“ã¨ãŒã§ãã¾ã™ã€‚

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, return_intermediate_steps=True
)
```

```python
result = chain("Who played in Top Gun?")
print(f"Intermediate steps: {result['intermediate_steps']}")
print(f"Final answer: {result['result']}")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'name': 'Tom Cruise'}, {'name': 'Val Kilmer'}, {'name': 'Anthony Edwards'}, {'name': 'Meg Ryan'}][0m

[1m> Finished chain.[0m
Intermediate steps: [{'query': "MATCH (a:Actor)-[:ACTED_IN]->(m:Movie)\nWHERE m.name = 'Top Gun'\nRETURN a.name"}, {'context': [{'name': 'Tom Cruise'}, {'name': 'Val Kilmer'}, {'name': 'Anthony Edwards'}, {'name': 'Meg Ryan'}]}]
Final answer: Tom Cruise, Val Kilmer, Anthony Edwards, Meg Ryan played in Top Gun.
```

## ç›´æ¥ã®çµæœã‚’è¿”ã™

`return_direct`ãƒ‘ãƒ©ãƒ¡ãƒ¼ã‚¿ãƒ¼ã‚’ä½¿ç”¨ã—ã¦ã€Cypher QAãƒã‚§ãƒ¼ãƒ³ã‹ã‚‰ã®ç›´æ¥ã®çµæœã‚’è¿”ã™ã“ã¨ãŒã§ãã¾ã™ã€‚

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, return_direct=True
)
```

```python
chain.invoke("Who played in Top Gun?")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie {name: 'Top Gun'})
RETURN a.name[0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': [{'name': 'Tom Cruise'},
  {'name': 'Val Kilmer'},
  {'name': 'Anthony Edwards'},
  {'name': 'Meg Ryan'}]}
```

## Cypherã®ç”Ÿæˆãƒ—ãƒ­ãƒ³ãƒ—ãƒˆã«ä¾‹ã‚’è¿½åŠ ã™ã‚‹

ç‰¹å®šã®è³ªå•ã«å¯¾ã—ã¦Cypherã‚¹ãƒ†ãƒ¼ãƒˆãƒ¡ãƒ³ãƒˆã‚’ç”Ÿæˆã—ãŸã„å ´åˆã¯ã€å®šç¾©ã§ãã¾ã™ã€‚

```python
from langchain_core.prompts.prompt import PromptTemplate

CYPHER_GENERATION_TEMPLATE = """Task:Generate Cypher statement to query a graph database.
Instructions:
Use only the provided relationship types and properties in the schema.
Do not use any other relationship types or properties that are not provided.
Schema:
{schema}
Note: Do not include any explanations or apologies in your responses.
Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.
Do not include any text except the generated Cypher statement.
Examples: Here are a few examples of generated Cypher statements for particular questions:
# How many people played in Top Gun?
MATCH (m:Movie {{title:"Top Gun"}})<-[:ACTED_IN]-()
RETURN count(*) AS numberOfActors

The question is:
{question}"""

CYPHER_GENERATION_PROMPT = PromptTemplate(
    input_variables=["schema", "question"], template=CYPHER_GENERATION_TEMPLATE
)

chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0),
    graph=graph,
    verbose=True,
    cypher_prompt=CYPHER_GENERATION_PROMPT,
)
```

```python
chain.invoke("How many people played in Top Gun?")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m

Generated Cypher:
[32;1m[1;3mMATCH (:Movie {name:"Top Gun"})<-[:ACTED_IN]-(:Actor)
RETURN count(*) AS numberOfActors[0m
Full Context:
[32;1m[1;3m[{'numberofactors': 4}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'How many people played in Top Gun?',
 'result': "I don't know the answer."}
```

## Cypherã¨å›ç­”ã®ç”Ÿæˆã«åˆ¥ã®LLMã‚’ä½¿ç”¨ã™ã‚‹

`cypher_llm`ã¨`qa_llm`ãƒ‘ãƒ©ãƒ¡ãƒ¼ã‚¿ãƒ¼ã‚’ä½¿ç”¨ã—ã¦ã€ç•°ãªã‚‹LLMã‚’å®šç¾©ã§ãã¾ã™ã€‚

```python
chain = GraphCypherQAChain.from_llm(
    graph=graph,
    cypher_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo"),
    qa_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo-16k"),
    verbose=True,
)
```

```python
chain.invoke("Who played in Top Gun?")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m

Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'name': 'Tom Cruise'}, {'name': 'Val Kilmer'}, {'name': 'Anthony Edwards'}, {'name': 'Meg Ryan'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Tom Cruise, Val Kilmer, Anthony Edwards, and Meg Ryan played in Top Gun.'}
```

## æŒ‡å®šã®ãƒãƒ¼ãƒ‰ã¨ãƒªãƒ¬ãƒ¼ã‚·ãƒ§ãƒ³ã‚·ãƒƒãƒ—ã‚¿ã‚¤ãƒ—ã‚’ç„¡è¦–ã™ã‚‹

`include_types`ã¾ãŸã¯`exclude_types`ã‚’ä½¿ç”¨ã—ã¦ã€Cypherã‚¹ãƒ†ãƒ¼ãƒˆãƒ¡ãƒ³ãƒˆã®ç”Ÿæˆæ™‚ã«ã‚°ãƒ©ãƒ•ã‚¹ã‚­ãƒ¼ãƒã®ä¸€éƒ¨ã‚’ç„¡è¦–ã§ãã¾ã™ã€‚

```python
chain = GraphCypherQAChain.from_llm(
    graph=graph,
    cypher_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo"),
    qa_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo-16k"),
    verbose=True,
    exclude_types=["Movie"],
)
```

```python
# Inspect graph schema
print(chain.graph_schema)
```

```output
Node properties are the following:
Actor {name: STRING},LabelA {property_a: STRING},LabelB {},LabelC {}
Relationship properties are the following:
ACTED_IN {},REL_TYPE {rel_prop: STRING}
The relationships are the following:
(:LabelA)-[:REL_TYPE]->(:LabelB),(:LabelA)-[:REL_TYPE]->(:LabelC)
```

## ç”Ÿæˆã•ã‚ŒãŸCypherã‚¹ãƒ†ãƒ¼ãƒˆãƒ¡ãƒ³ãƒˆã‚’æ¤œè¨¼ã™ã‚‹

`validate_cypher`ãƒ‘ãƒ©ãƒ¡ãƒ¼ã‚¿ãƒ¼ã‚’ä½¿ç”¨ã—ã¦ã€ç”Ÿæˆã•ã‚ŒãŸCypherã‚¹ãƒ†ãƒ¼ãƒˆãƒ¡ãƒ³ãƒˆã‚’æ¤œè¨¼ã—ã€ãƒªãƒ¬ãƒ¼ã‚·ãƒ§ãƒ³ã‚·ãƒƒãƒ—ã®æ–¹å‘ã‚’ä¿®æ­£ã§ãã¾ã™ã€‚

```python
chain = GraphCypherQAChain.from_llm(
    llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo"),
    graph=graph,
    verbose=True,
    validate_cypher=True,
)
```

```python
chain.invoke("Who played in Top Gun?")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'name': 'Tom Cruise'}, {'name': 'Val Kilmer'}, {'name': 'Anthony Edwards'}, {'name': 'Meg Ryan'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Tom Cruise, Val Kilmer, Anthony Edwards, Meg Ryan played in Top Gun.'}
```
