---
translated: true
---

# Neo4j

>[Neo4j](https://neo4j.com/docs/getting-started/)ã¯ã€`Neo4j, Inc`ã«ã‚ˆã£ã¦é–‹ç™ºã•ã‚ŒãŸã‚°ãƒ©ãƒ•ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ç®¡ç†ã‚·ã‚¹ãƒ†ãƒ ã§ã™ã€‚

>`Neo4j`ãŒä¿å­˜ã™ã‚‹ãƒ‡ãƒ¼ã‚¿è¦ç´ ã¯ã€ãƒãƒ¼ãƒ‰ã€ãã‚Œã‚‰ã‚’æ¥ç¶šã™ã‚‹ã‚¨ãƒƒã‚¸ã€ãŠã‚ˆã³ãƒãƒ¼ãƒ‰ã¨ã‚¨ãƒƒã‚¸ã®å±æ€§ã§ã™ã€‚é–‹ç™ºè€…ã«ã‚ˆã‚‹ã¨ã€`Neo4j`ã¯ACIDæº–æ‹ ã®ãƒˆãƒ©ãƒ³ã‚¶ã‚¯ã‚·ãƒ§ãƒ³ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã§ã€ãƒã‚¤ãƒ†ã‚£ãƒ–ã®ã‚°ãƒ©ãƒ•ã‚¹ãƒˆãƒ¬ãƒ¼ã‚¸ã¨å‡¦ç†ã‚’å‚™ãˆã¦ã„ã¾ã™ã€‚`Neo4j`ã¯ã€GNU General Public Licenseã®æ”¹å¤‰ç‰ˆã§ãƒ©ã‚¤ã‚»ãƒ³ã‚¹ã•ã‚ŒãŸéã‚ªãƒ¼ãƒ—ãƒ³ã‚½ãƒ¼ã‚¹ã®ã€Œã‚³ãƒŸãƒ¥ãƒ‹ãƒ†ã‚£ã‚¨ãƒ‡ã‚£ã‚·ãƒ§ãƒ³ã€ã§æä¾›ã•ã‚Œã¦ãŠã‚Šã€ã‚ªãƒ³ãƒ©ã‚¤ãƒ³ãƒãƒƒã‚¯ã‚¢ãƒƒãƒ—ã¨é«˜å¯ç”¨æ€§æ‹¡å¼µæ©Ÿèƒ½ã¯é–‰é–ã‚½ãƒ¼ã‚¹ã®å•†ç”¨ãƒ©ã‚¤ã‚»ãƒ³ã‚¹ã®ä¸‹ã§ãƒ©ã‚¤ã‚»ãƒ³ã‚¹ã•ã‚Œã¦ã„ã¾ã™ã€‚Neoã¯ã€ã“ã‚Œã‚‰ã®æ‹¡å¼µæ©Ÿèƒ½ã‚’é–‰é–ã‚½ãƒ¼ã‚¹ã®å•†ç”¨æ¡ä»¶ã§ã‚‚`Neo4j`ã«ãƒ©ã‚¤ã‚»ãƒ³ã‚¹ã—ã¦ã„ã¾ã™ã€‚

>ã“ã®ãƒãƒ¼ãƒˆãƒ–ãƒƒã‚¯ã§ã¯ã€LLMã‚’ä½¿ã£ã¦ã‚°ãƒ©ãƒ•ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã«è‡ªç„¶è¨€èªã‚¤ãƒ³ã‚¿ãƒ¼ãƒ•ã‚§ã‚¤ã‚¹ã‚’æä¾›ã—ã€`Cypher`ã‚¯ã‚¨ãƒªè¨€èªã§ã‚¯ã‚¨ãƒªã§ãã‚‹ã‚ˆã†ã«ã™ã‚‹æ–¹æ³•ã‚’ç¤ºã—ã¾ã™ã€‚

>[Cypher](https://en.wikipedia.org/wiki/Cypher_(query_language))ã¯ã€ãƒ—ãƒ­ãƒ‘ãƒ†ã‚£ã‚°ãƒ©ãƒ•ã§ãƒ‡ãƒ¼ã‚¿ã‚’åŠ¹ç‡çš„ã‹ã¤è¡¨ç¾åŠ›è±Šã‹ã«ã‚¯ã‚¨ãƒªã§ãã‚‹å®£è¨€å‹ã®ã‚°ãƒ©ãƒ•ã‚¯ã‚¨ãƒªè¨€èªã§ã™ã€‚

## ã‚»ãƒƒãƒˆã‚¢ãƒƒãƒ—

`Neo4j`ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã‚’å®Ÿè¡Œã™ã‚‹å¿…è¦ãŒã‚ã‚Šã¾ã™ã€‚1ã¤ã®ã‚ªãƒ—ã‚·ãƒ§ãƒ³ã¯ã€[Neo4jã®Auraã‚¯ãƒ©ã‚¦ãƒ‰ã‚µãƒ¼ãƒ“ã‚¹ã§ç„¡æ–™ã®Neo4jãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã‚’ä½œæˆ](https://neo4j.com/cloud/platform/aura-graph-database/)ã™ã‚‹ã“ã¨ã§ã™ã€‚ã¾ãŸã€[Neo4j Desktopã‚¢ãƒ—ãƒªã‚±ãƒ¼ã‚·ãƒ§ãƒ³](https://neo4j.com/download/)ã‚’ä½¿ã£ã¦ãƒ­ãƒ¼ã‚«ãƒ«ã§ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã‚’å®Ÿè¡Œã—ãŸã‚Šã€Dockerã‚³ãƒ³ãƒ†ãƒŠã‚’å®Ÿè¡Œã—ãŸã‚Šã™ã‚‹ã“ã¨ã‚‚ã§ãã¾ã™ã€‚
æ¬¡ã®ã‚¹ã‚¯ãƒªãƒ—ãƒˆã‚’å®Ÿè¡Œã—ã¦ãƒ­ãƒ¼ã‚«ãƒ«ã®Dockerã‚³ãƒ³ãƒ†ãƒŠã‚’å®Ÿè¡Œã§ãã¾ã™:

```bash
docker run \
    --name neo4j \
    -p 7474:7474 -p 7687:7687 \
    -d \
    -e NEO4J_AUTH=neo4j/password \
    -e NEO4J_PLUGINS=\[\"apoc\"\]  \
    neo4j:latest
```

Dockerã‚³ãƒ³ãƒ†ãƒŠã‚’ä½¿ç”¨ã—ã¦ã„ã‚‹å ´åˆã¯ã€ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã®èµ·å‹•ã«æ•°ç§’ã‹ã‹ã‚‹ã®ã§å¾…ã¤å¿…è¦ãŒã‚ã‚Šã¾ã™ã€‚

```python
from langchain.chains import GraphCypherQAChain
from langchain_community.graphs import Neo4jGraph
from langchain_openai import ChatOpenAI
```

```python
graph = Neo4jGraph(url="bolt://localhost:7687", username="neo4j", password="password")
```

## ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã®åˆæœŸåŒ–

ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ãŒç©ºã®å ´åˆã€Cypherã‚¯ã‚¨ãƒªè¨€èªã‚’ä½¿ã£ã¦ãƒ‡ãƒ¼ã‚¿ã‚’å…¥åŠ›ã§ãã¾ã™ã€‚æ¬¡ã®Cypherã‚¹ãƒ†ãƒ¼ãƒˆãƒ¡ãƒ³ãƒˆã¯å†ªç­‰æ€§ãŒã‚ã‚Šã€1å›ã¾ãŸã¯è¤‡æ•°å›å®Ÿè¡Œã—ã¦ã‚‚åŒã˜ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹æƒ…å ±ã«ãªã‚Šã¾ã™ã€‚

```python
graph.query(
    """
MERGE (m:Movie {name:"Top Gun", runtime: 120})
WITH m
UNWIND ["Tom Cruise", "Val Kilmer", "Anthony Edwards", "Meg Ryan"] AS actor
MERGE (a:Actor {name:actor})
MERGE (a)-[:ACTED_IN]->(m)
"""
)
```

```output
[]
```

## ã‚°ãƒ©ãƒ•ã‚¹ã‚­ãƒ¼ãƒæƒ…å ±ã®æ›´æ–°

ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã®ã‚¹ã‚­ãƒ¼ãƒãŒå¤‰æ›´ã•ã‚ŒãŸå ´åˆã¯ã€Cypherã‚¹ãƒ†ãƒ¼ãƒˆãƒ¡ãƒ³ãƒˆã‚’ç”Ÿæˆã™ã‚‹ãŸã‚ã«å¿…è¦ãªã‚¹ã‚­ãƒ¼ãƒæƒ…å ±ã‚’æ›´æ–°ã§ãã¾ã™ã€‚

```python
graph.refresh_schema()
```

```python
print(graph.schema)
```

```output
Node properties:
Movie {runtime: INTEGER, name: STRING}
Actor {name: STRING}
Relationship properties:

The relationships:
(:Actor)-[:ACTED_IN]->(:Movie)
```

## æ‹¡å¼µã•ã‚ŒãŸã‚¹ã‚­ãƒ¼ãƒæƒ…å ±

æ‹¡å¼µã•ã‚ŒãŸã‚¹ã‚­ãƒ¼ãƒãƒãƒ¼ã‚¸ãƒ§ãƒ³ã‚’é¸æŠã™ã‚‹ã¨ã€ã‚·ã‚¹ãƒ†ãƒ ãŒãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹å†…ã®ä¾‹å€¤ã‚’ã‚¹ã‚­ãƒ£ãƒ³ã—ã€ã„ãã¤ã‹ã®åˆ†å¸ƒãƒ¡ãƒˆãƒªãƒƒã‚¯ã‚’è¨ˆç®—ã§ãã‚‹ã‚ˆã†ã«ãªã‚Šã¾ã™ã€‚ãŸã¨ãˆã°ã€ãƒãƒ¼ãƒ‰ãƒ—ãƒ­ãƒ‘ãƒ†ã‚£ã«10ç¨®é¡æœªæº€ã®å€¤ã—ã‹ãªã„å ´åˆã¯ã€ã™ã¹ã¦ã®å¯èƒ½ãªå€¤ã‚’ã‚¹ã‚­ãƒ¼ãƒã«è¿”ã—ã¾ã™ã€‚ãã‚Œä»¥å¤–ã®å ´åˆã¯ã€ãƒãƒ¼ãƒ‰ãŠã‚ˆã³é–¢ä¿‚ãƒ—ãƒ­ãƒ‘ãƒ†ã‚£ã”ã¨ã«1ã¤ã®ä¾‹å€¤ã®ã¿ã‚’è¿”ã—ã¾ã™ã€‚

```python
enhanced_graph = Neo4jGraph(
    url="bolt://localhost:7687",
    username="neo4j",
    password="password",
    enhanced_schema=True,
)
print(enhanced_graph.schema)
```

```output
Node properties:
- **Movie**
  - `runtime: INTEGER` Min: 120, Max: 120
  - `name: STRING` Available options: ['Top Gun']
- **Actor**
  - `name: STRING` Available options: ['Tom Cruise', 'Val Kilmer', 'Anthony Edwards', 'Meg Ryan']
Relationship properties:

The relationships:
(:Actor)-[:ACTED_IN]->(:Movie)
```

## ã‚°ãƒ©ãƒ•ã®ã‚¯ã‚¨ãƒª

ã‚°ãƒ©ãƒ•CypherQAãƒã‚§ãƒ¼ãƒ³ã‚’ä½¿ã£ã¦ã€ã‚°ãƒ©ãƒ•ã«è³ªå•ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True
)
```

```python
chain.invoke({"query": "Who played in Top Gun?"})
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'a.name': 'Anthony Edwards'}, {'a.name': 'Meg Ryan'}, {'a.name': 'Val Kilmer'}, {'a.name': 'Tom Cruise'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Anthony Edwards, Meg Ryan, Val Kilmer, Tom Cruise played in Top Gun.'}
```

## çµæœã®æ•°ã‚’åˆ¶é™ã™ã‚‹

`top_k`ãƒ‘ãƒ©ãƒ¡ãƒ¼ã‚¿ãƒ¼ã‚’ä½¿ã£ã¦CypherQAãƒã‚§ãƒ¼ãƒ³ã‹ã‚‰ã®çµæœã®æ•°ã‚’åˆ¶é™ã§ãã¾ã™ã€‚
ãƒ‡ãƒ•ã‚©ãƒ«ãƒˆã¯10ã§ã™ã€‚

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, top_k=2
)
```

```python
chain.invoke({"query": "Who played in Top Gun?"})
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'a.name': 'Anthony Edwards'}, {'a.name': 'Meg Ryan'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Anthony Edwards, Meg Ryan played in Top Gun.'}
```

## ä¸­é–“çµæœã‚’è¿”ã™

`return_intermediate_steps`ãƒ‘ãƒ©ãƒ¡ãƒ¼ã‚¿ãƒ¼ã‚’ä½¿ã£ã¦CypherQAãƒã‚§ãƒ¼ãƒ³ã‹ã‚‰ä¸­é–“ã‚¹ãƒ†ãƒƒãƒ—ã‚’è¿”ã™ã“ã¨ãŒã§ãã¾ã™ã€‚

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, return_intermediate_steps=True
)
```

```python
result = chain.invoke({"query": "Who played in Top Gun?"})
print(f"Intermediate steps: {result['intermediate_steps']}")
print(f"Final answer: {result['result']}")
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'a.name': 'Anthony Edwards'}, {'a.name': 'Meg Ryan'}, {'a.name': 'Val Kilmer'}, {'a.name': 'Tom Cruise'}][0m

[1m> Finished chain.[0m
Intermediate steps: [{'query': "MATCH (a:Actor)-[:ACTED_IN]->(m:Movie)\nWHERE m.name = 'Top Gun'\nRETURN a.name"}, {'context': [{'a.name': 'Anthony Edwards'}, {'a.name': 'Meg Ryan'}, {'a.name': 'Val Kilmer'}, {'a.name': 'Tom Cruise'}]}]
Final answer: Anthony Edwards, Meg Ryan, Val Kilmer, Tom Cruise played in Top Gun.
```

## ç›´æ¥çµæœã‚’è¿”ã™

`return_direct`ãƒ‘ãƒ©ãƒ¡ãƒ¼ã‚¿ãƒ¼ã‚’ä½¿ã£ã¦CypherQAãƒã‚§ãƒ¼ãƒ³ã‹ã‚‰ç›´æ¥çµæœã‚’è¿”ã™ã“ã¨ãŒã§ãã¾ã™ã€‚

```python
chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, return_direct=True
)
```

```python
chain.invoke({"query": "Who played in Top Gun?"})
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': [{'a.name': 'Anthony Edwards'},
  {'a.name': 'Meg Ryan'},
  {'a.name': 'Val Kilmer'},
  {'a.name': 'Tom Cruise'}]}
```

## Cypherã®ç”Ÿæˆãƒ—ãƒ­ãƒ³ãƒ—ãƒˆã«ä¾‹ã‚’è¿½åŠ ã™ã‚‹

ç‰¹å®šã®è³ªå•ã«å¯¾ã—ã¦LLMãŒç”Ÿæˆã™ã‚‹Cypherã‚¹ãƒ†ãƒ¼ãƒˆãƒ¡ãƒ³ãƒˆã‚’å®šç¾©ã§ãã¾ã™ã€‚

```python
from langchain_core.prompts.prompt import PromptTemplate

CYPHER_GENERATION_TEMPLATE = """Task:Generate Cypher statement to query a graph database.
Instructions:
Use only the provided relationship types and properties in the schema.
Do not use any other relationship types or properties that are not provided.
Schema:
{schema}
Note: Do not include any explanations or apologies in your responses.
Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.
Do not include any text except the generated Cypher statement.
Examples: Here are a few examples of generated Cypher statements for particular questions:
# How many people played in Top Gun?
MATCH (m:Movie {{title:"Top Gun"}})<-[:ACTED_IN]-()
RETURN count(*) AS numberOfActors

The question is:
{question}"""

CYPHER_GENERATION_PROMPT = PromptTemplate(
    input_variables=["schema", "question"], template=CYPHER_GENERATION_TEMPLATE
)

chain = GraphCypherQAChain.from_llm(
    ChatOpenAI(temperature=0),
    graph=graph,
    verbose=True,
    cypher_prompt=CYPHER_GENERATION_PROMPT,
)
```

```python
chain.invoke({"query": "How many people played in Top Gun?"})
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (:Movie {name:"Top Gun"})<-[:ACTED_IN]-()
RETURN count(*) AS numberOfActors[0m
Full Context:
[32;1m[1;3m[{'numberOfActors': 4}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'How many people played in Top Gun?',
 'result': 'There were 4 actors who played in Top Gun.'}
```

## Cypherã¨Answerç”Ÿæˆã«åˆ¥ã®LLMã‚’ä½¿ã†

`cypher_llm`ã¨`qa_llm`ãƒ‘ãƒ©ãƒ¡ãƒ¼ã‚¿ãƒ¼ã‚’ä½¿ã£ã¦ã€ç•°ãªã‚‹LLMã‚’å®šç¾©ã§ãã¾ã™ã€‚

```python
chain = GraphCypherQAChain.from_llm(
    graph=graph,
    cypher_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo"),
    qa_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo-16k"),
    verbose=True,
)
```

```python
chain.invoke({"query": "Who played in Top Gun?"})
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'a.name': 'Anthony Edwards'}, {'a.name': 'Meg Ryan'}, {'a.name': 'Val Kilmer'}, {'a.name': 'Tom Cruise'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Anthony Edwards, Meg Ryan, Val Kilmer, and Tom Cruise played in Top Gun.'}
```

## æŒ‡å®šã—ãŸãƒãƒ¼ãƒ‰ãŠã‚ˆã³é–¢ä¿‚ã‚¿ã‚¤ãƒ—ã‚’ç„¡è¦–ã™ã‚‹

`include_types`ã¾ãŸã¯`exclude_types`ã‚’ä½¿ã£ã¦ã€Cypherã‚¹ãƒ†ãƒ¼ãƒˆãƒ¡ãƒ³ãƒˆã®ç”Ÿæˆæ™‚ã«ã‚°ãƒ©ãƒ•ã‚¹ã‚­ãƒ¼ãƒã®ä¸€éƒ¨ã‚’ç„¡è¦–ã§ãã¾ã™ã€‚

```python
chain = GraphCypherQAChain.from_llm(
    graph=graph,
    cypher_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo"),
    qa_llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo-16k"),
    verbose=True,
    exclude_types=["Movie"],
)
```

```python
# Inspect graph schema
print(chain.graph_schema)
```

```output
Node properties are the following:
Actor {name: STRING}
Relationship properties are the following:

The relationships are the following:
```

## ç”Ÿæˆã•ã‚ŒãŸCypherã‚¹ãƒ†ãƒ¼ãƒˆãƒ¡ãƒ³ãƒˆã‚’æ¤œè¨¼ã™ã‚‹

`validate_cypher`ãƒ‘ãƒ©ãƒ¡ãƒ¼ã‚¿ãƒ¼ã‚’ä½¿ã£ã¦ã€ç”Ÿæˆã•ã‚ŒãŸCypherã‚¹ãƒ†ãƒ¼ãƒˆãƒ¡ãƒ³ãƒˆã®é–¢ä¿‚ã®æ–¹å‘ã‚’æ¤œè¨¼ãŠã‚ˆã³ä¿®æ­£ã§ãã¾ã™ã€‚

```python
chain = GraphCypherQAChain.from_llm(
    llm=ChatOpenAI(temperature=0, model="gpt-3.5-turbo"),
    graph=graph,
    verbose=True,
    validate_cypher=True,
)
```

```python
chain.invoke({"query": "Who played in Top Gun?"})
```

```output


[1m> Entering new GraphCypherQAChain chain...[0m
Generated Cypher:
[32;1m[1;3mMATCH (a:Actor)-[:ACTED_IN]->(m:Movie)
WHERE m.name = 'Top Gun'
RETURN a.name[0m
Full Context:
[32;1m[1;3m[{'a.name': 'Anthony Edwards'}, {'a.name': 'Meg Ryan'}, {'a.name': 'Val Kilmer'}, {'a.name': 'Tom Cruise'}][0m

[1m> Finished chain.[0m
```

```output
{'query': 'Who played in Top Gun?',
 'result': 'Anthony Edwards, Meg Ryan, Val Kilmer, Tom Cruise played in Top Gun.'}
```
