---
translated: true
---

# RDFLib

>[RDFLib](https://rdflib.readthedocs.io/) ã¯ [RDF](https://en.wikipedia.org/wiki/Resource_Description_Framework) ã‚’æ‰±ã†ãŸã‚ã®ç´”ç²‹ãªPythonãƒ‘ãƒƒã‚±ãƒ¼ã‚¸ã§ã™ã€‚ `RDFLib` ã«ã¯ `RDF` ã‚’æ‰±ã†ãŸã‚ã«å¿…è¦ãªã»ã¨ã‚“ã©ã®ã‚‚ã®ãŒå«ã¾ã‚Œã¦ã„ã¾ã™ã€‚ä¾‹ãˆã°ï¼š
>- RDF/XMLã€N3ã€NTriplesã€N-Quadsã€Turtleã€TriXã€Trigã€JSON-LDã®ãŸã‚ã®ãƒ‘ãƒ¼ã‚µãƒ¼ã¨ã‚·ãƒªã‚¢ãƒ©ã‚¤ã‚¶ãƒ¼
>- ã„ãã¤ã‹ã®ã‚¹ãƒˆã‚¢å®Ÿè£…ã«ã‚ˆã£ã¦ãƒãƒƒã‚¯ã‚¢ãƒƒãƒ—ã•ã‚Œã‚‹ã‚°ãƒ©ãƒ•ã‚¤ãƒ³ã‚¿ãƒ¼ãƒ•ã‚§ãƒ¼ã‚¹
>- ãƒ¡ãƒ¢ãƒªå†…ã€ãƒ‡ã‚£ã‚¹ã‚¯ä¸Šã®æ°¸ç¶šï¼ˆBerkeley DBï¼‰ã€ãƒªãƒ¢ãƒ¼ãƒˆSPARQLã‚¨ãƒ³ãƒ‰ãƒã‚¤ãƒ³ãƒˆå‘ã‘ã®ã‚¹ãƒˆã‚¢å®Ÿè£…
>- SPARQL 1.1 å®Ÿè£… - SPARQL 1.1 ã‚¯ã‚¨ãƒªã¨æ›´æ–°ã‚¹ãƒ†ãƒ¼ãƒˆãƒ¡ãƒ³ãƒˆã‚’ã‚µãƒãƒ¼ãƒˆ
>- SPARQL é–¢æ•°æ‹¡å¼µãƒ¡ã‚«ãƒ‹ã‚ºãƒ 

ã‚°ãƒ©ãƒ•ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã¯ã€ãƒãƒƒãƒˆãƒ¯ãƒ¼ã‚¯ã®ã‚ˆã†ãªãƒ¢ãƒ‡ãƒ«ã«åŸºã¥ãã‚¢ãƒ—ãƒªã‚±ãƒ¼ã‚·ãƒ§ãƒ³ã«æœ€é©ãªé¸æŠè‚¢ã§ã™ã€‚ã“ã®ã‚ˆã†ãªã‚°ãƒ©ãƒ•ã®æ§‹æ–‡ã¨æ„å‘³ã‚’æ¨™æº–åŒ–ã™ã‚‹ãŸã‚ã«ã€W3Cã¯ `Semantic Web Technologies` ã‚’æ¨å¥¨ã—ã¦ã„ã¾ã™ã€‚å‚ç…§ï¼š[Semantic Web](https://www.w3.org/standards/semanticweb/)ã€‚

[SPARQL](https://www.w3.org/TR/sparql11-query/) ã¯ã€ã“ã‚Œã‚‰ã®ã‚°ãƒ©ãƒ•ã«å¯¾ã™ã‚‹ã‚¯ã‚¨ãƒªè¨€èªã¨ã—ã¦ `SQL` ã‚„ `Cypher` ã«é¡ä¼¼ã—ã¦ã„ã¾ã™ã€‚ã“ã®ãƒãƒ¼ãƒˆãƒ–ãƒƒã‚¯ã§ã¯ã€LLMã‚’è‡ªç„¶è¨€èªã‚¤ãƒ³ã‚¿ãƒ¼ãƒ•ã‚§ãƒ¼ã‚¹ã¨ã—ã¦ã‚°ãƒ©ãƒ•ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã«é©ç”¨ã—ã€`SPARQL` ã‚’ç”Ÿæˆã™ã‚‹æ–¹æ³•ã‚’ç¤ºã—ã¾ã™ã€‚

**å…è²¬äº‹é …:** ç¾åœ¨ã®ã¨ã“ã‚ã€LLMã«ã‚ˆã‚‹ `SPARQL` ã‚¯ã‚¨ãƒªç”Ÿæˆã¯ã¾ã ä¸å®‰å®šã§ã™ã€‚ç‰¹ã«ã‚°ãƒ©ãƒ•ã‚’å¤‰æ›´ã™ã‚‹ `UPDATE` ã‚¯ã‚¨ãƒªã«ã¯æ³¨æ„ãŒå¿…è¦ã§ã™ã€‚

## è¨­å®š

Pythonãƒ©ã‚¤ãƒ–ãƒ©ãƒªã‚’ã‚¤ãƒ³ã‚¹ãƒˆãƒ¼ãƒ«ã™ã‚‹å¿…è¦ãŒã‚ã‚Šã¾ã™:

```python
!pip install rdflib
```

ã‚¯ã‚¨ãƒªã‚’å®Ÿè¡Œã™ã‚‹ãŸã‚ã®ã‚½ãƒ¼ã‚¹ã¯ã„ãã¤ã‹ã‚ã‚Šã¾ã™ã€‚ä¾‹ãˆã°ã€ã‚¦ã‚§ãƒ–ä¸Šã®ãƒ•ã‚¡ã‚¤ãƒ«ã€ãƒ­ãƒ¼ã‚«ãƒ«ã«åˆ©ç”¨å¯èƒ½ãªãƒ•ã‚¡ã‚¤ãƒ«ã€SPARQLã‚¨ãƒ³ãƒ‰ãƒã‚¤ãƒ³ãƒˆï¼ˆä¾‹ï¼š [Wikidata](https://www.wikidata.org/wiki/Wikidata:Main_Page)ï¼‰ã€ãŠã‚ˆã³ [ãƒˆãƒªãƒ—ãƒ«ã‚¹ãƒˆã‚¢](https://www.w3.org/wiki/LargeTripleStores) ã§ã™ã€‚

```python
from langchain.chains import GraphSparqlQAChain
from langchain_community.graphs import RdfGraph
from langchain_openai import ChatOpenAI
```

```python
graph = RdfGraph(
    source_file="http://www.w3.org/People/Berners-Lee/card",
    standard="rdf",
    local_copy="test.ttl",
)
```

ã‚½ãƒ¼ã‚¹ãŒèª­ã¿å–ã‚Šå°‚ç”¨ã®å ´åˆã€å¤‰æ›´ã‚’ãƒ­ãƒ¼ã‚«ãƒ«ã«ä¿å­˜ã™ã‚‹ãŸã‚ã« `local_file` ã‚’æä¾›ã™ã‚‹å¿…è¦ãŒã‚ã‚‹ã“ã¨ã«æ³¨æ„ã—ã¦ãã ã•ã„ã€‚

## ã‚°ãƒ©ãƒ•ã‚¹ã‚­ãƒ¼ãƒæƒ…å ±ã®æ›´æ–°

ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã®ã‚¹ã‚­ãƒ¼ãƒãŒå¤‰æ›´ã•ã‚ŒãŸå ´åˆã€SPARQLã‚¯ã‚¨ãƒªã‚’ç”Ÿæˆã™ã‚‹ãŸã‚ã«å¿…è¦ãªã‚¹ã‚­ãƒ¼ãƒæƒ…å ±ã‚’æ›´æ–°ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

```python
graph.load_schema()
```

```python
graph.get_schema
```

```output
In the following, each IRI is followed by the local name and optionally its description in parentheses.
The RDF graph supports the following node types:
<http://xmlns.com/foaf/0.1/PersonalProfileDocument> (PersonalProfileDocument, None), <http://www.w3.org/ns/auth/cert#RSAPublicKey> (RSAPublicKey, None), <http://www.w3.org/2000/10/swap/pim/contact#Male> (Male, None), <http://xmlns.com/foaf/0.1/Person> (Person, None), <http://www.w3.org/2006/vcard/ns#Work> (Work, None)
The RDF graph supports the following relationships:
<http://www.w3.org/2000/01/rdf-schema#seeAlso> (seeAlso, None), <http://purl.org/dc/elements/1.1/title> (title, None), <http://xmlns.com/foaf/0.1/mbox_sha1sum> (mbox_sha1sum, None), <http://xmlns.com/foaf/0.1/maker> (maker, None), <http://www.w3.org/ns/solid/terms#oidcIssuer> (oidcIssuer, None), <http://www.w3.org/2000/10/swap/pim/contact#publicHomePage> (publicHomePage, None), <http://xmlns.com/foaf/0.1/openid> (openid, None), <http://www.w3.org/ns/pim/space#storage> (storage, None), <http://xmlns.com/foaf/0.1/name> (name, None), <http://www.w3.org/2000/10/swap/pim/contact#country> (country, None), <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> (type, None), <http://www.w3.org/ns/solid/terms#profileHighlightColor> (profileHighlightColor, None), <http://www.w3.org/ns/pim/space#preferencesFile> (preferencesFile, None), <http://www.w3.org/2000/01/rdf-schema#label> (label, None), <http://www.w3.org/ns/auth/cert#modulus> (modulus, None), <http://www.w3.org/2000/10/swap/pim/contact#participant> (participant, None), <http://www.w3.org/2000/10/swap/pim/contact#street2> (street2, None), <http://www.w3.org/2006/vcard/ns#locality> (locality, None), <http://xmlns.com/foaf/0.1/nick> (nick, None), <http://xmlns.com/foaf/0.1/homepage> (homepage, None), <http://creativecommons.org/ns#license> (license, None), <http://xmlns.com/foaf/0.1/givenname> (givenname, None), <http://www.w3.org/2006/vcard/ns#street-address> (street-address, None), <http://www.w3.org/2006/vcard/ns#postal-code> (postal-code, None), <http://www.w3.org/2000/10/swap/pim/contact#street> (street, None), <http://www.w3.org/2003/01/geo/wgs84_pos#lat> (lat, None), <http://xmlns.com/foaf/0.1/primaryTopic> (primaryTopic, None), <http://www.w3.org/2006/vcard/ns#fn> (fn, None), <http://www.w3.org/2003/01/geo/wgs84_pos#location> (location, None), <http://usefulinc.com/ns/doap#developer> (developer, None), <http://www.w3.org/2000/10/swap/pim/contact#city> (city, None), <http://www.w3.org/2006/vcard/ns#region> (region, None), <http://xmlns.com/foaf/0.1/member> (member, None), <http://www.w3.org/2003/01/geo/wgs84_pos#long> (long, None), <http://www.w3.org/2000/10/swap/pim/contact#address> (address, None), <http://xmlns.com/foaf/0.1/family_name> (family_name, None), <http://xmlns.com/foaf/0.1/account> (account, None), <http://xmlns.com/foaf/0.1/workplaceHomepage> (workplaceHomepage, None), <http://purl.org/dc/terms/title> (title, None), <http://www.w3.org/ns/solid/terms#publicTypeIndex> (publicTypeIndex, None), <http://www.w3.org/2000/10/swap/pim/contact#office> (office, None), <http://www.w3.org/2000/10/swap/pim/contact#homePage> (homePage, None), <http://xmlns.com/foaf/0.1/mbox> (mbox, None), <http://www.w3.org/2000/10/swap/pim/contact#preferredURI> (preferredURI, None), <http://www.w3.org/ns/solid/terms#profileBackgroundColor> (profileBackgroundColor, None), <http://schema.org/owns> (owns, None), <http://xmlns.com/foaf/0.1/based_near> (based_near, None), <http://www.w3.org/2006/vcard/ns#hasAddress> (hasAddress, None), <http://xmlns.com/foaf/0.1/img> (img, None), <http://www.w3.org/2000/10/swap/pim/contact#assistant> (assistant, None), <http://xmlns.com/foaf/0.1/title> (title, None), <http://www.w3.org/ns/auth/cert#key> (key, None), <http://www.w3.org/ns/ldp#inbox> (inbox, None), <http://www.w3.org/ns/solid/terms#editableProfile> (editableProfile, None), <http://www.w3.org/2000/10/swap/pim/contact#postalCode> (postalCode, None), <http://xmlns.com/foaf/0.1/weblog> (weblog, None), <http://www.w3.org/ns/auth/cert#exponent> (exponent, None), <http://rdfs.org/sioc/ns#avatar> (avatar, None)
```

## ã‚°ãƒ©ãƒ•ã®ã‚¯ã‚¨ãƒª

ä»Šã€ã‚°ãƒ©ãƒ•SPARQL QAãƒã‚§ãƒ¼ãƒ³ã‚’ä½¿ç”¨ã—ã¦ã€ã‚°ãƒ©ãƒ•ã«é–¢ã™ã‚‹è³ªå•ã‚’ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

```python
chain = GraphSparqlQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True
)
```

```python
chain.run("What is Tim Berners-Lee's work homepage?")
```

```output


[1m> Entering new GraphSparqlQAChain chain...[0m
Identified intent:
[32;1m[1;3mSELECT[0m
Generated SPARQL:
[32;1m[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?homepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?homepage .
}[0m
Full Context:
[32;1m[1;3m[][0m

[1m> Finished chain.[0m
```

```output
"Tim Berners-Lee's work homepage is http://www.w3.org/People/Berners-Lee/."
```

## ã‚°ãƒ©ãƒ•ã®æ›´æ–°

åŒæ§˜ã«ã€è‡ªç„¶è¨€èªã‚’ä½¿ç”¨ã—ã¦ãƒˆãƒªãƒ—ãƒ«ã‚’æŒ¿å…¥ã™ã‚‹ã“ã¨ã§ã‚°ãƒ©ãƒ•ã‚’æ›´æ–°ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

```python
chain.run(
    "Save that the person with the name 'Timothy Berners-Lee' has a work homepage at 'http://www.w3.org/foo/bar/'"
)
```

```output


[1m> Entering new GraphSparqlQAChain chain...[0m
Identified intent:
[32;1m[1;3mUPDATE[0m
Generated SPARQL:
[32;1m[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>
INSERT {
    ?person foaf:workplaceHomepage <http://www.w3.org/foo/bar/> .
}
WHERE {
    ?person foaf:name "Timothy Berners-Lee" .
}[0m

[1m> Finished chain.[0m
```

```output
'Successfully inserted triples into the graph.'
```

çµæœã‚’ç¢ºèªã—ã¾ã—ã‚‡ã†ï¼š

```python
query = (
    """PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n"""
    """SELECT ?hp\n"""
    """WHERE {\n"""
    """    ?person foaf:name "Timothy Berners-Lee" . \n"""
    """    ?person foaf:workplaceHomepage ?hp .\n"""
    """}"""
)
graph.query(query)
```

```output
[(rdflib.term.URIRef('https://www.w3.org/'),),
 (rdflib.term.URIRef('http://www.w3.org/foo/bar/'),)]
```

## SQARQLã‚¯ã‚¨ãƒªã‚’è¿”ã™

`return_sparql_query` ãƒ‘ãƒ©ãƒ¡ãƒ¼ã‚¿ã‚’ä½¿ç”¨ã—ã¦ã€Sparql QAãƒã‚§ãƒ¼ãƒ³ã‹ã‚‰SPARQLã‚¯ã‚¨ãƒªã‚¹ãƒ†ãƒƒãƒ—ã‚’è¿”ã™ã“ã¨ãŒã§ãã¾ã™

```python
chain = GraphSparqlQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, return_sparql_query=True
)
```

```python
result = chain("What is Tim Berners-Lee's work homepage?")
print(f"SQARQL query: {result['sparql_query']}")
print(f"Final answer: {result['result']}")
```

```output


[1m> Entering new GraphSparqlQAChain chain...[0m
Identified intent:
[32;1m[1;3mSELECT[0m
Generated SPARQL:
[32;1m[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?workHomepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?workHomepage .
}[0m
Full Context:
[32;1m[1;3m[][0m

[1m> Finished chain.[0m
SQARQL query: PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?workHomepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?workHomepage .
}
Final answer: Tim Berners-Lee's work homepage is http://www.w3.org/People/Berners-Lee/.
```

```python
print(result["sparql_query"])
```

```output
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?workHomepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?workHomepage .
}
```
