---
translated: true
---

# Ontotext GraphDB

>[Ontotext GraphDB](https://graphdb.ontotext.com/) рдПрдХ рдЧреНрд░рд╛рдл рдбреЗрдЯрд╛рдмреЗрд╕ рдФрд░ [RDF](https://www.w3.org/RDF/) рдФрд░ [SPARQL](https://www.w3.org/TR/sparql11-query/) рдХреЗ рдЕрдиреБрд░реВрдк рдЬреНрдЮрд╛рди рдЦреЛрдЬ рдЙрдкрдХрд░рдг рд╣реИред

>рдпрд╣ рдиреЛрдЯрдмреБрдХ рджрд┐рдЦрд╛рддрд╛ рд╣реИ рдХрд┐ рдХреИрд╕реЗ LLM рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ рдкреНрд░рд╛рдХреГрддрд┐рдХ рднрд╛рд╖рд╛ рдХреНрд╡реЗрд░реА (NLQ to SPARQL, рдЬрд┐рд╕реЗ `text2sparql` рднреА рдХрд╣рд╛ рдЬрд╛рддрд╛ рд╣реИ) рдХрд╛ рдЙрдкрдпреЛрдЧ `Ontotext GraphDB` рдХреЗ рд▓рд┐рдП рдХрд┐рдпрд╛ рдЬрд╛ рд╕рдХрддрд╛ рд╣реИред

## GraphDB LLM рдХрд╛рд░реНрдпрдХреНрд╖рдорддрд╛рдПрдВ

`GraphDB` рдХреБрдЫ LLM рдПрдХреАрдХрд░рдг рдХрд╛рд░реНрдпрдХреНрд╖рдорддрд╛рдПрдВ рд╕рдорд░реНрдерд┐рдд рдХрд░рддрд╛ рд╣реИ рдЬреИрд╕рд╛ рдХрд┐ [рдпрд╣рд╛рдВ](https://github.com/w3c/sparql-dev/issues/193) рд╡рд░реНрдгрд┐рдд рд╣реИ:

[gpt-queries](https://graphdb.ontotext.com/documentation/10.5/gpt-queries.html)

* рдЕрдкрдиреЗ рдЬреНрдЮрд╛рди рдЧреНрд░рд╛рдл (KG) рд╕реЗ рдбреЗрдЯрд╛ рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ рдХрд┐рд╕реА LLM рд╕реЗ рдкрд╛рда, рд╕реВрдЪреА рдпрд╛ рддрд╛рд▓рд┐рдХрд╛ рдкреВрдЫрдиреЗ рдХреЗ рд▓рд┐рдП рдЬрд╛рджреБрдИ рдкреНрд░реЗрдбрд┐рдХреЗрдЯ
* рдХреНрд╡реЗрд░реА рд╡реНрдпрд╛рдЦреНрдпрд╛
* рдкрд░рд┐рдгрд╛рдо рд╡реНрдпрд╛рдЦреНрдпрд╛, рд╕рд╛рд░рд╛рдВрд╢, рдкреБрдирд░реНрдкреНрд░рд╛рд░реВрдкрдг, рдЕрдиреБрд╡рд╛рдж

[retrieval-graphdb-connector](https://graphdb.ontotext.com/documentation/10.5/retrieval-graphdb-connector.html)

* рдПрдХ рд╡реЗрдХреНрдЯрд░ рдбреЗрдЯрд╛рдмреЗрд╕ рдореЗрдВ KG рдкреНрд░рдХреГрддрд┐рдпреЛрдВ рдХрд╛ рдЕрдиреБрдХреНрд░рдордг
* рдХрд┐рд╕реА рднреА рдкрд╛рда рдПрдореНрдмреЗрдбрд┐рдВрдЧ рдПрд▓реНрдЧреЛрд░рд┐рджрдо рдФрд░ рд╡реЗрдХреНрдЯрд░ рдбреЗрдЯрд╛рдмреЗрд╕ рдХрд╛ рд╕рдорд░реНрдерди рдХрд░рддрд╛ рд╣реИ
* GraphDB рджреНрд╡рд╛рд░рд╛ Elastic, Solr, Lucene рдХреЗ рд▓рд┐рдП рдЙрдкрдпреЛрдЧ рдХрд┐рдП рдЬрд╛рдиреЗ рд╡рд╛рд▓реЗ рд╢рдХреНрддрд┐рд╢рд╛рд▓реА рдХрдиреЗрдХреНрдЯрд░ (рдЕрдиреБрдХреНрд░рдордг) рднрд╛рд╖рд╛ рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рддрд╛ рд╣реИ
* RDF рдбреЗрдЯрд╛ рдореЗрдВ рдкрд░рд┐рд╡рд░реНрддрдиреЛрдВ рдХрд╛ KG рдкреНрд░рдХреГрддрд┐ рд╕реВрдЪрдХрд╛рдВрдХ рдореЗрдВ рд╕реНрд╡рдЪрд╛рд▓рд┐рдд рд╕рдордиреНрд╡рдпрди
* рдЕрд╡рд╕реНрдерд┐рдд рд╡рд╕реНрддреБрдУрдВ рдХрд╛ рд╕рдорд░реНрдерди рдХрд░рддрд╛ рд╣реИ (GraphDB рд╕рдВрд╕реНрдХрд░рдг 10.5 рдореЗрдВ UI рд╕рдорд░реНрдерди рдирд╣реАрдВ)
* KG рдкреНрд░рдХреГрддрд┐рдпреЛрдВ рдХреЛ рдЗрд╕ рддрд░рд╣ рд╕реЗ рдкрд╛рда рдореЗрдВ рд╕реАрд░рд┐рдпрд▓рд╛рдЗрдЬрд╝ рдХрд░рддрд╛ рд╣реИ (рдЙрджрд╛рд╣рд░рдг рдХреЗ рд▓рд┐рдП рдПрдХ Wines рдбреЗрдЯрд╛рд╕реЗрдЯ рдХреЗ рд▓рд┐рдП):

```text
Franvino:
- is a RedWine.
- made from grape Merlo.
- made from grape Cabernet Franc.
- has sugar dry.
- has year 2012.
```

[talk-to-graph](https://graphdb.ontotext.com/documentation/10.5/talk-to-graph.html)

* рдПрдХ рдкрд░рд┐рднрд╛рд╖рд┐рдд KG рдкреНрд░рдХреГрддрд┐ рд╕реВрдЪрдХрд╛рдВрдХ рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ рдПрдХ рд╕рд░рд▓ рдЪреИрдЯрдмреЙрдЯ

рдЗрд╕ рдЯреНрдпреВрдЯреЛрд░рд┐рдпрд▓ рдХреЗ рд▓рд┐рдП, рд╣рдо GraphDB LLM рдПрдХреАрдХрд░рдг рдХрд╛ рдЙрдкрдпреЛрдЧ рдирд╣реАрдВ рдХрд░реЗрдВрдЧреЗ, рдмрд▓реНрдХрд┐ NLQ рд╕реЗ SPARQL рдЙрддреНрдкрд╛рджрди рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВрдЧреЗред рд╣рдо `Star Wars API` (`SWAPI`) рдСрдВрдЯреЛрд▓реЙрдЬреА рдФрд░ рдбреЗрдЯрд╛рд╕реЗрдЯ рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВрдЧреЗ рдЬрд┐рд╕рдХрд╛ рдкрд░реАрдХреНрд╖рдг [рдпрд╣рд╛рдВ](https://github.com/Ontotext-AD/langchain-graphdb-qa-chain-demo/blob/main/starwars-data.trig) рдХрд┐рдпрд╛ рдЬрд╛ рд╕рдХрддрд╛ рд╣реИред

## рд╕реЗрдЯрдЕрдк рдХрд░рдирд╛

рдЖрдкрдХреЛ рдПрдХ рдЪрд▓ рд░рд╣рд╛ GraphDB рдЗрдВрд╕реНрдЯреЗрдВрд╕ рдХреА рдЖрд╡рд╢реНрдпрдХрддрд╛ рд╣реИред рдпрд╣ рдЯреНрдпреВрдЯреЛрд░рд┐рдпрд▓ рджрд┐рдЦрд╛рддрд╛ рд╣реИ рдХрд┐ [GraphDB Docker рдЫрд╡рд┐](https://hub.docker.com/r/ontotext/graphdb) рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ рд╕реНрдерд╛рдиреАрдп рд░реВрдк рд╕реЗ рдбреЗрдЯрд╛рдмреЗрд╕ рдХреИрд╕реЗ рдЪрд▓рд╛рдпрд╛ рдЬрд╛рдПред рдпрд╣ рдПрдХ docker compose рд╕реЗрдЯ-рдЕрдк рдкреНрд░рджрд╛рди рдХрд░рддрд╛ рд╣реИ, рдЬреЛ GraphDB рдХреЛ Star Wars рдбреЗрдЯрд╛рд╕реЗрдЯ рд╕реЗ рднрд░ рджреЗрддрд╛ рд╣реИред рд╕рднреА рдЖрд╡рд╢реНрдпрдХ рдлрд╝рд╛рдЗрд▓реЗрдВ, рдЗрд╕ рдиреЛрдЯрдмреБрдХ рд╕рд╣рд┐рдд, [langchain-graphdb-qa-chain-demo GitHub рд░рд┐рдкреЙрдЬрд┐рдЯрд░реА](https://github.com/Ontotext-AD/langchain-graphdb-qa-chain-demo) рд╕реЗ рдбрд╛рдЙрдирд▓реЛрдб рдХреА рдЬрд╛ рд╕рдХрддреА рд╣реИрдВред

* [Docker](https://docs.docker.com/get-docker/) рдЗрдВрд╕реНрдЯреЙрд▓ рдХрд░реЗрдВред рдпрд╣ рдЯреНрдпреВрдЯреЛрд░рд┐рдпрд▓ [Docker Compose](https://docs.docker.com/compose/) рдХреЗ рд╕рд╛рде рдмрдВрдбрд▓ рдХрд┐рдП рдЧрдП Docker рд╕рдВрд╕реНрдХрд░рдг `24.0.7` рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ рдмрдирд╛рдпрд╛ рдЧрдпрд╛ рд╣реИред рдкреБрд░рд╛рдиреЗ Docker рд╕рдВрд╕реНрдХрд░рдгреЛрдВ рдХреЗ рд▓рд┐рдП рдЖрдкрдХреЛ Docker Compose рдЕрд▓рдЧ рд╕реЗ рдЗрдВрд╕реНрдЯреЙрд▓ рдХрд░рдирд╛ рдкрдбрд╝ рд╕рдХрддрд╛ рд╣реИред
* [langchain-graphdb-qa-chain-demo GitHub рд░рд┐рдкреЙрдЬрд┐рдЯрд░реА](https://github.com/Ontotext-AD/langchain-graphdb-qa-chain-demo) рдХреЛ рдЕрдкрдиреЗ рдорд╢реАрди рдкрд░ рд╕реНрдерд╛рдиреАрдп рдлрд╝реЛрд▓реНрдбрд░ рдореЗрдВ рдХреНрд▓реЛрди рдХрд░реЗрдВред
* рдирд┐рдореНрдирд▓рд┐рдЦрд┐рдд рд╕реНрдХреНрд░рд┐рдкреНрдЯ рдХреЛ рдЙрд╕реА рдлрд╝реЛрд▓реНрдбрд░ рд╕реЗ рдирд┐рд╖реНрдкрд╛рджрд┐рдд рдХрд░рдХреЗ GraphDB рд╢реБрд░реВ рдХрд░реЗрдВред

```bash
docker build --tag graphdb .
docker compose up -d graphdb
```

  рдбреЗрдЯрд╛рдмреЗрд╕ `http://localhost:7200/` рдкрд░ рд╢реБрд░реВ рд╣реЛрдиреЗ рдХреЗ рд▓рд┐рдП рдХреБрдЫ рд╕реЗрдХрдВрдб рдкреНрд░рддреАрдХреНрд╖рд╛ рдХрд░рдиреА рд╣реЛрдЧреАред рд╕реНрдЯрд╛рд░ рд╡рд╛рд░реНрд╕ рдбреЗрдЯрд╛рд╕реЗрдЯ `starwars-data.trig` рд╕реНрд╡рдЪрд╛рд▓рд┐рдд рд░реВрдк рд╕реЗ `langchain` рд░рд┐рдкреЙрдЬрд┐рдЯрд░реА рдореЗрдВ рд▓реЛрдб рдХрд┐рдпрд╛ рдЬрд╛рддрд╛ рд╣реИред рд╕реНрдерд╛рдиреАрдп SPARQL рдПрдВрдбрдкреЙрдЗрдВрдЯ `http://localhost:7200/repositories/langchain` рдХрд╛ рдЙрдкрдпреЛрдЧ рдХреНрд╡реЗрд░реА рдЪрд▓рд╛рдиреЗ рдХреЗ рд▓рд┐рдП рдХрд┐рдпрд╛ рдЬрд╛ рд╕рдХрддрд╛ рд╣реИред рдЖрдк рдЕрдкрдиреЗ рдкрд╕рдВрджреАрджрд╛ рд╡реЗрдм рдмреНрд░рд╛рдЙрдЬрд╝рд░ `http://localhost:7200/sparql` рд╕реЗ GraphDB рд╡рд░реНрдХрдмреЗрдВрдЪ рднреА рдЦреЛрд▓ рд╕рдХрддреЗ рд╣реИрдВ рдЬрд╣рд╛рдВ рдЖрдк рдЗрдВрдЯрд░реИрдХреНрдЯрд┐рд╡ рд░реВрдк рд╕реЗ рдХреНрд╡реЗрд░реА рдХрд░ рд╕рдХрддреЗ рд╣реИрдВред
* рдХрд╛рд░реНрдпрд╢реАрд▓ рд╡рд╛рддрд╛рд╡рд░рдг рд╕реЗрдЯ рдХрд░реЗрдВ

рдпрджрд┐ рдЖрдк `conda` рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рддреЗ рд╣реИрдВ, рддреЛ рдПрдХ рдирдпрд╛ conda env рдмрдирд╛рдПрдВ рдФрд░ рд╕рдХреНрд░рд┐рдп рдХрд░реЗрдВ (рдЙрджрд╛рд╣рд░рдг рдХреЗ рд▓рд┐рдП `conda create -n graph_ontotext_graphdb_qa python=3.9.18`)ред

рдирд┐рдореНрдирд▓рд┐рдЦрд┐рдд рд▓рд╛рдЗрдмреНрд░реЗрд░рд┐рдпреЛрдВ рдХреЛ рдЗрдВрд╕реНрдЯреЙрд▓ рдХрд░реЗрдВ:

```bash
pip install jupyter==1.0.0
pip install openai==1.6.1
pip install rdflib==7.0.0
pip install langchain-openai==0.0.2
pip install langchain>=0.1.5
```

Jupyter рдХреЛ рдирд┐рдореНрдирд╛рдиреБрд╕рд╛рд░ рдЪрд▓рд╛рдПрдВ:

```bash
jupyter notebook
```

## рд╡рд┐рд╢реЗрд╖рддрд╛ рдХрд░рдирд╛

рдЬрд┐рд╕ рдкреНрд░рдХрд╛рд░ рд╕реЗ рдПрд▓рдПрд▓рдПрдо рдХреЛ рдПрд╕рдкреАрдПрдЖрд░рдХреНрдпреВрдПрд▓ рдЙрддреНрдкрдиреНрди рдХрд░рдиреЗ рдореЗрдВ рд╕рдХреНрд╖рдо рд╣реЛрдирд╛ рдЪрд╛рд╣рд┐рдП, рдЙрд╕рдХреЗ рд▓рд┐рдП рдЙрд╕реЗ рдЬреНрдЮрд╛рди рдЧреНрд░рд╛рдлрд╝ рд╕реНрдХреАрдорд╛ (рд╡рд┐рд╢реЗрд╖рддрд╛) рдХрд╛ рдЬреНрдЮрд╛рди рд╣реЛрдирд╛ рдЪрд╛рд╣рд┐рдПред рдЗрд╕реЗ `OntotextGraphDBGraph` рд╡рд░реНрдЧ рдкрд░ рдирд┐рдореНрдирд▓рд┐рдЦрд┐рдд рджреЛ рдкреИрд░рд╛рдореАрдЯрд░реЛрдВ рдореЗрдВ рд╕реЗ рдПрдХ рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ рдкреНрд░рджрд╛рди рдХрд┐рдпрд╛ рдЬрд╛ рд╕рдХрддрд╛ рд╣реИ:

* `query_ontology`: рдПрдХ `CONSTRUCT` рдХреНрд╡реЗрд░реА рдЬреЛ рдПрд╕рдкреАрдПрдЖрд░рдХреНрдпреВрдПрд▓ рдПрдВрдбрдкреЙрдЗрдВрдЯ рдкрд░ рдирд┐рд╖реНрдкрд╛рджрд┐рдд рдХреА рдЬрд╛рддреА рд╣реИ рдФрд░ рдХреЗрдЬреА рд╕реНрдХреАрдорд╛ рдмрдпрд╛рдиреЛрдВ рдХреЛ рд╡рд╛рдкрд╕ рд▓реМрдЯрд╛рддреА рд╣реИред рд╣рдо рд╕рд┐рдлрд╛рд░рд┐рд╢ рдХрд░рддреЗ рд╣реИрдВ рдХрд┐ рдЖрдк рд╡рд┐рд╢реЗрд╖рддрд╛ рдХреЛ рдЕрдкрдиреЗ рдЦреБрдж рдХреЗ рдирд╛рдорд┐рдд рдЧреНрд░рд╛рдл рдореЗрдВ рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд░реЗрдВ, рдЬрд┐рд╕рд╕реЗ рдХреЗрд╡рд▓ рдкреНрд░рд╛рд╕рдВрдЧрд┐рдХ рдмрдпрд╛рдиреЛрдВ рдХреЛ рдкреНрд░рд╛рдкреНрдд рдХрд░рдирд╛ рдЖрд╕рд╛рди рд╣реЛ рдЬрд╛рдПрдЧрд╛ (рдЬреИрд╕рд╛ рдХрд┐ рдиреАрдЪреЗ рдЙрджрд╛рд╣рд░рдг рдореЗрдВ рд╣реИ)ред `DESCRIBE` рдХреНрд╡реЗрд░рд┐рдпреЛрдВ рдХрд╛ рд╕рдорд░реНрдерди рдирд╣реАрдВ рд╣реИ, рдХреНрдпреЛрдВрдХрд┐ `DESCRIBE` рд╕рд┐рдореЗрдЯреНрд░рд┐рдХ рдХрдВрд╕рд╛рдЗрд╕ рдмрд╛рдЙрдВрдбреЗрдб рдбрд┐рд╕реНрдХреНрд░рд┐рдкреНрд╢рди (SCBD) рд╡рд╛рдкрд╕ рдХрд░рддрд╛ рд╣реИ, рдпрд╛рдиреА рд╡рд░реНрдЧ рд▓рд┐рдВрдХ рднреАред рдмрдбрд╝реЗ рдЧреНрд░рд╛рдлреЛрдВ рдореЗрдВ, рдЬрд╣рд╛рдВ рдорд┐рд▓рд┐рдпрди рдЗрдВрд╕реНрдЯреЗрдВрд╕ рд╣реЛрдВ, рдпрд╣ рдХреБрд╢рд▓ рдирд╣реАрдВ рд╣реИред https://github.com/eclipse-rdf4j/rdf4j/issues/4857 рдкрд░ рдЬрд╛рдБрдЪ рдХрд░реЗрдВ
* `local_file`: рдПрдХ рд╕реНрдерд╛рдиреАрдп рдЖрд░рдбреАрдПрдл рд╡рд┐рд╢реЗрд╖рддрд╛ рдлрд╝рд╛рдЗрд▓ред рд╕рдорд░реНрдерд┐рдд рдЖрд░рдбреАрдПрдл рдкреНрд░рд╛рд░реВрдк `Turtle`, `RDF/XML`, `JSON-LD`, `N-Triples`, `Notation-3`, `Trig`, `Trix`, `N-Quads` рд╣реИрдВред

рдХрд┐рд╕реА рднреА рдорд╛рдорд▓реЗ рдореЗрдВ, рд╡рд┐рд╢реЗрд╖рддрд╛ рдбрдВрдк рдореЗрдВ рдирд┐рдореНрдирд▓рд┐рдЦрд┐рдд рд╣реЛрдирд╛ рдЪрд╛рд╣рд┐рдП:

* рд╡рд░реНрдЧреЛрдВ, рдЧреБрдгреЛрдВ, рд╡рд░реНрдЧреЛрдВ рдкрд░ рдЧреБрдг рд╕рдВрд▓рдЧреНрдирддрд╛ (rdfs:domain, schema:domainIncludes рдпрд╛ OWL рдкреНрд░рддрд┐рдмрдВрдзреЛрдВ рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ) рдФрд░ рд╡рд░реНрдЧреАрдХрд░рдг (рдорд╣рддреНрд╡рдкреВрд░реНрдг рд╡реНрдпрдХреНрддрд┐) рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ рдкрд░реНрдпрд╛рдкреНрдд рдЬрд╛рдирдХрд╛рд░реА рд╢рд╛рдорд┐рд▓ рд╣реЛред
* рдЕрддреНрдпрдзрд┐рдХ рд╡рд┐рд╕реНрддреГрдд рдФрд░ рдЕрдкреНрд░рд╛рд╕рдВрдЧрд┐рдХ рдкрд░рд┐рднрд╛рд╖рд╛рдУрдВ рдФрд░ рдЙрджрд╛рд╣рд░рдгреЛрдВ рдХреЛ рд╢рд╛рдорд┐рд▓ рди рдХрд░реЗрдВ рдЬреЛ рдПрд╕рдкреАрдПрдЖрд░рдХреНрдпреВрдПрд▓ рдирд┐рд░реНрдорд╛рдг рдореЗрдВ рдорджрдж рдирд╣реАрдВ рдХрд░рддреЗ рд╣реИрдВред

```python
from langchain_community.graphs import OntotextGraphDBGraph

# feeding the schema using a user construct query

graph = OntotextGraphDBGraph(
    query_endpoint="http://localhost:7200/repositories/langchain",
    query_ontology="CONSTRUCT {?s ?p ?o} FROM <https://swapi.co/ontology/> WHERE {?s ?p ?o}",
)
```

```python
# feeding the schema using a local RDF file

graph = OntotextGraphDBGraph(
    query_endpoint="http://localhost:7200/repositories/langchain",
    local_file="/path/to/langchain_graphdb_tutorial/starwars-ontology.nt",  # change the path here
)
```

рдХрд┐рд╕реА рднреА рддрд░рд╣ рд╕реЗ, рд╡рд┐рд╢реЗрд╖рддрд╛ (рд╕реНрдХреАрдорд╛) рдХреЛ `Turtle` рдХреЗ рд░реВрдк рдореЗрдВ рдПрд▓рдПрд▓рдПрдо рдХреЛ рдлрд╝реАрдб рдХрд┐рдпрд╛ рдЬрд╛рддрд╛ рд╣реИ рдХреНрдпреЛрдВрдХрд┐ рдЙрдкрдпреБрдХреНрдд рдЙрдкрд╕рд░реНрдЧреЛрдВ рдХреЗ рд╕рд╛рде `Turtle` рд╕рдмрд╕реЗ рд╕рдВрдХреНрд╖рд┐рдкреНрдд рдФрд░ рдПрд▓рдПрд▓рдПрдо рдХреЗ рд▓рд┐рдП рд╕рдмрд╕реЗ рдЖрд╕рд╛рди рд╣реИред

рд╕реНрдЯрд╛рд░ рд╡реЙрд░реНрд╕ рд╡рд┐рд╢реЗрд╖рддрд╛ рдереЛрдбрд╝реА рдЕрд╕рд╛рдорд╛рдиреНрдп рд╣реИ рдХреНрдпреЛрдВрдХрд┐ рдЗрд╕рдореЗрдВ рд╡рд░реНрдЧреЛрдВ рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ рдХрдИ рд╡рд┐рд╢рд┐рд╖реНрдЯ рддреНрд░рд┐рдкрд▓ рд╢рд╛рдорд┐рд▓ рд╣реИрдВ, рдЬреИрд╕реЗ рдХрд┐ рдкреНрд░рдЬрд╛рддрд┐ `:Aleena` `<planet/38>` рдкрд░ рд░рд╣рддреА рд╣реИрдВ, рд╡реЗ `:Reptile` рдХреА рдЙрдкрдкреНрд░рдЬрд╛рддрд┐ рд╣реИрдВ, рдЙрдирдХреЗ рдХреБрдЫ рдкреНрд░рддрд┐рдирд┐рдзрд┐ рд▓рдХреНрд╖рдг (рдФрд╕рдд рдКрдВрдЪрд╛рдИ, рдФрд╕рдд рдЖрдпреБ, рддреНрд╡рдЪрд╛ рд░рдВрдЧ) рд╣реИрдВ, рдФрд░ рд╡рд┐рд╢рд┐рд╖реНрдЯ рд╡реНрдпрдХреНрддрд┐ (рдЪрд░рд┐рддреНрд░) рдЙрд╕ рд╡рд░реНрдЧ рдХреЗ рдкреНрд░рддрд┐рдирд┐рдзрд┐ рд╣реИрдВ:

```output
@prefix : <https://swapi.co/vocabulary/> .
@prefix owl: <http://www.w3.org/2002/07/owl#> .
@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .

:Aleena a owl:Class, :Species ;
    rdfs:label "Aleena" ;
    rdfs:isDefinedBy <https://swapi.co/ontology/> ;
    rdfs:subClassOf :Reptile, :Sentient ;
    :averageHeight 80.0 ;
    :averageLifespan "79" ;
    :character <https://swapi.co/resource/aleena/47> ;
    :film <https://swapi.co/resource/film/4> ;
    :language "Aleena" ;
    :planet <https://swapi.co/resource/planet/38> ;
    :skinColor "blue", "gray" .

    ...

```

рдЗрд╕ рдЯреНрдпреВрдЯреЛрд░рд┐рдпрд▓ рдХреЛ рд╕рд░рд▓ рд░рдЦрдиреЗ рдХреЗ рд▓рд┐рдП, рд╣рдо рдЕрд╕реБрд░рдХреНрд╖рд┐рдд GraphDB рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рддреЗ рд╣реИрдВред рдпрджрд┐ GraphDB рд╕реБрд░рдХреНрд╖рд┐рдд рд╣реИ, рддреЛ `OntotextGraphDBGraph` рдХреЗ рдкреНрд░рд╛рд░рдВрднреАрдХрд░рдг рд╕реЗ рдкрд╣рд▓реЗ рдЖрдкрдХреЛ 'GRAPHDB_USERNAME' рдФрд░ 'GRAPHDB_PASSWORD' рдкрд░реНрдпрд╛рд╡рд░рдг рдЪрд░ рд╕реЗрдЯ рдХрд░рдиреЗ рдЪрд╛рд╣рд┐рдПред

```python
os.environ["GRAPHDB_USERNAME"] = "graphdb-user"
os.environ["GRAPHDB_PASSWORD"] = "graphdb-password"

graph = OntotextGraphDBGraph(
    query_endpoint=...,
    query_ontology=...
)
```

## рд╕реНрдЯрд╛рд░ рд╡реЙрд░реНрд╕ рдбреЗрдЯрд╛рд╕реЗрдЯ рдХреЗ рдЦрд┐рд▓рд╛рдл рдкреНрд░рд╢реНрди рдЙрддреНрддрд░

рдЕрдм рд╣рдо `OntotextGraphDBQAChain` рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░ рдХреБрдЫ рдкреНрд░рд╢реНрди рдкреВрдЫ рд╕рдХрддреЗ рд╣реИрдВред

```python
import os

from langchain.chains import OntotextGraphDBQAChain
from langchain_openai import ChatOpenAI

# We'll be using an OpenAI model which requires an OpenAI API Key.
# However, other models are available as well:
# https://python.langchain.com/docs/integrations/chat/

# Set the environment variable `OPENAI_API_KEY` to your OpenAI API key
os.environ["OPENAI_API_KEY"] = "sk-***"

# Any available OpenAI model can be used here.
# We use 'gpt-4-1106-preview' because of the bigger context window.
# The 'gpt-4-1106-preview' model_name will deprecate in the future and will change to 'gpt-4-turbo' or similar,
# so be sure to consult with the OpenAI API https://platform.openai.com/docs/models for the correct naming.

chain = OntotextGraphDBQAChain.from_llm(
    ChatOpenAI(temperature=0, model_name="gpt-4-1106-preview"),
    graph=graph,
    verbose=True,
)
```

рдЪрд▓реЛ рдПрдХ рд╕рд░рд▓ рдкреНрд░рд╢реНрди рдкреВрдЫрддреЗ рд╣реИрдВред

```python
chain.invoke({chain.input_key: "What is the climate on Tatooine?"})[chain.output_key]
```

```output


[1m> Entering new OntotextGraphDBQAChain chain...[0m
Generated SPARQL:
[32;1m[1;3mPREFIX : <https://swapi.co/vocabulary/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>

SELECT ?climate
WHERE {
  ?planet rdfs:label "Tatooine" ;
          :climate ?climate .
}[0m

[1m> Finished chain.[0m
```

```output
'The climate on Tatooine is arid.'
```

рдФрд░ рдереЛрдбрд╝рд╛ рдЕрдзрд┐рдХ рдЬрдЯрд┐рд▓ред

```python
chain.invoke({chain.input_key: "What is the climate on Luke Skywalker's home planet?"})[
    chain.output_key
]
```

```output


[1m> Entering new OntotextGraphDBQAChain chain...[0m
Generated SPARQL:
[32;1m[1;3mPREFIX : <https://swapi.co/vocabulary/>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>

SELECT ?climate
WHERE {
  ?character rdfs:label "Luke Skywalker" .
  ?character :homeworld ?planet .
  ?planet :climate ?climate .
}[0m

[1m> Finished chain.[0m
```

```output
"The climate on Luke Skywalker's home planet is arid."
```

рд╣рдо рдФрд░ рднреА рдЬрдЯрд┐рд▓ рдкреНрд░рд╢реНрди рдкреВрдЫ рд╕рдХрддреЗ рд╣реИрдВ рдЬреИрд╕реЗ рдХрд┐

```python
chain.invoke(
    {
        chain.input_key: "What is the average box office revenue for all the Star Wars movies?"
    }
)[chain.output_key]
```

```output


[1m> Entering new OntotextGraphDBQAChain chain...[0m
Generated SPARQL:
[32;1m[1;3mPREFIX : <https://swapi.co/vocabulary/>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>

SELECT (AVG(?boxOffice) AS ?averageBoxOffice)
WHERE {
  ?film a :Film .
  ?film :boxOffice ?boxOfficeValue .
  BIND(xsd:decimal(?boxOfficeValue) AS ?boxOffice)
}
[0m

[1m> Finished chain.[0m
```

```output
'The average box office revenue for all the Star Wars movies is approximately 754.1 million dollars.'
```

## рд╢реНрд░реГрдВрдЦрд▓рд╛ рд╕рдВрд╢реЛрдзрдХ

Ontotext GraphDB QA рд╢реНрд░реГрдВрдЦрд▓рд╛ рдЖрдкрдХреЗ QA рд╢реНрд░реГрдВрдЦрд▓рд╛ рдХреЛ рдФрд░ рдЕрдзрд┐рдХ рд╕реБрдзрд╛рд░рдиреЗ рдФрд░ рдЖрдкрдХреЗ рдРрдк рдХреЗ рд╕рдордЧреНрд░ рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдЕрдиреБрднрд╡ рдХреЛ рдмреЗрд╣рддрд░ рдмрдирд╛рдиреЗ рдХреЗ рд▓рд┐рдП рдкреНрд░реЙрдореНрдкреНрдЯ рд░рд┐рдлрд╛рдЗрдирдореЗрдВрдЯ рдХреА рдЕрдиреБрдорддрд┐ рджреЗрддреА рд╣реИред

### "SPARQL Generation" рдкреНрд░реЙрдореНрдкреНрдЯ

рдкреНрд░реЙрдореНрдкреНрдЯ рдХрд╛ рдЙрдкрдпреЛрдЧ рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЗ рдкреНрд░рд╢реНрди рдФрд░ рдХреЗрдЬреА рд╕реНрдХреАрдорд╛ рдХреЗ рдЖрдзрд╛рд░ рдкрд░ рдПрд╕рдкреАрдПрдЖрд░рдХреНрдпреВрдПрд▓ рдХреНрд╡реЗрд░реА рдЬрдирд░реЗрд╢рди рдХреЗ рд▓рд┐рдП рдХрд┐рдпрд╛ рдЬрд╛рддрд╛ рд╣реИред

- `sparql_generation_prompt`

    рдбрд┐рдлрд╝реЙрд▓реНрдЯ рдорд╛рди:
  ````python
    GRAPHDB_SPARQL_GENERATION_TEMPLATE = """
    рдЧреНрд░рд╛рдлрд╝ рдбреЗрдЯрд╛рдмреЗрд╕ рдХреЛ рдХреНрд╡реЗрд░реА рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдПрдХ SPARQL SELECT рдХреНрд╡реЗрд░реА рд▓рд┐рдЦреЗрдВред
    рддреНрд░рд┐рдкрд▓ рдмреИрдХрдЯрд┐рдХреНрд╕ рджреНрд╡рд╛рд░рд╛ рд╕реАрдорд┐рдд рдЯрд░реНрдЯрд▓ рдкреНрд░рд╛рд░реВрдк рдореЗрдВ рд╡рд┐рд╢реЗрд╖рддрд╛ рд╕реНрдХреАрдорд╛ рд╣реИ:
    ```
    {schema}
    ```
    рдХреЗрд╡рд▓ рд╕реНрдХреАрдорд╛ рдореЗрдВ рдкреНрд░рджрд╛рди рдХрд┐рдП рдЧрдП рд╡рд░реНрдЧреЛрдВ рдФрд░ рдЧреБрдгреЛрдВ рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ SPARQL рдХреНрд╡реЗрд░реА рдХрд╛ рдирд┐рд░реНрдорд╛рдг рдХрд░реЗрдВред
    рд╕реНрдХреАрдорд╛ рдореЗрдВ рд╕реНрдкрд╖реНрдЯ рд░реВрдк рд╕реЗ рдкреНрд░рджрд╛рди рди рдХрд┐рдП рдЧрдП рдХрд┐рд╕реА рднреА рд╡рд░реНрдЧ рдпрд╛ рдЧреБрдг рдХрд╛ рдЙрдкрдпреЛрдЧ рди рдХрд░реЗрдВред
    рд╕рднреА рдЖрд╡рд╢реНрдпрдХ рдЙрдкрд╕рд░реНрдЧреЛрдВ рдХреЛ рд╢рд╛рдорд┐рд▓ рдХрд░реЗрдВред
    рдЕрдкрдиреЗ рдЙрддреНрддрд░реЛрдВ рдореЗрдВ рдХреЛрдИ рднреА рд╡реНрдпрд╛рдЦреНрдпрд╛ рдпрд╛ рдорд╛рдлреА рд╢рд╛рдорд┐рд▓ рди рдХрд░реЗрдВред
    рдХреНрд╡реЗрд░реА рдХреЛ рдмреИрдХрдЯрд┐рдХреНрд╕ рдореЗрдВ рди рд▓рдкреЗрдЯреЗрдВред
    рдХреЗрд╡рд▓ рдЙрддреНрдкрдиреНрди рдХрд┐рдП рдЧрдП SPARQL рдХреНрд╡реЗрд░реА рдХреЛ рдЫреЛрдбрд╝рдХрд░ рдХреЛрдИ рдЕрдиреНрдп рдкрд╛рда рди рд╢рд╛рдорд┐рд▓ рдХрд░реЗрдВред
    рддреНрд░рд┐рдкрд▓ рдмреИрдХрдЯрд┐рдХреНрд╕ рджреНрд╡рд╛рд░рд╛ рд╕реАрдорд┐рдд рдкреНрд░рд╢реНрди рд╣реИ:
    ```
    {prompt}
    ```
    """
    GRAPHDB_SPARQL_GENERATION_PROMPT = PromptTemplate(
        input_variables=["schema", "prompt"],
        template=GRAPHDB_SPARQL_GENERATION_TEMPLATE,
    )
  ````

### "SPARQL Fix" рдкреНрд░реЙрдореНрдкреНрдЯ

рдХрднреА-рдХрднреА, рдПрд▓рдПрд▓рдПрдо рдПрдХ SPARQL рдХреНрд╡реЗрд░реА рдЙрддреНрдкрдиреНрди рдХрд░ рд╕рдХрддрд╛ рд╣реИ рдЬрд┐рд╕рдореЗрдВ рд╡реНрдпрд╛рдХрд░рдгрд┐рдХ рддреНрд░реБрдЯрд┐рдпрд╛рдВ рдпрд╛ рдЙрдкрд╕рд░реНрдЧреЛрдВ рдХреА рдХрдореА рд╣реЛ рд╕рдХрддреА рд╣реИред рд╢реНрд░реГрдВрдЦрд▓рд╛ рдЗрд╕реЗ рд╕реБрдзрд╛рд░рдиреЗ рдХрд╛ рдкреНрд░рдпрд╛рд╕ рдХрд░реЗрдЧреА рдПрдХ рдирд┐рд╢реНрдЪрд┐рдд рд╕рдВрдЦреНрдпрд╛ рдореЗрдВ рдмрд╛рд░ рдкреНрд░реЙрдореНрдкреНрдЯ рдХрд░рдХреЗред

- `sparql_fix_prompt`

    рдбрд┐рдлрд╝реЙрд▓реНрдЯ рдорд╛рди:
  ````python
    GRAPHDB_SPARQL_FIX_TEMPLATE = """
    рдпрд╣ рдирд┐рдореНрдирд▓рд┐рдЦрд┐рдд SPARQL рдХреНрд╡реЗрд░реА рдЬреЛ рддреНрд░рд┐рдкрд▓ рдмреИрдХрдЯрд┐рдХреНрд╕ рджреНрд╡рд╛рд░рд╛ рд╕реАрдорд┐рдд рд╣реИ
    ```
    {generated_sparql}
    ```
    рдорд╛рдиреНрдп рдирд╣реАрдВ рд╣реИред
    рддреНрд░реБрдЯрд┐ рдЬреЛ рддреНрд░рд┐рдкрд▓ рдмреИрдХрдЯрд┐рдХреНрд╕ рджреНрд╡рд╛рд░рд╛ рд╕реАрдорд┐рдд рд╣реИ
    ```
    {error_message}
    ```
    рдореБрдЭреЗ SPARQL рдХреНрд╡реЗрд░реА рдХрд╛ рд╕рд╣реА рд╕рдВрд╕реНрдХрд░рдг рджреЗрдВред
    рдХреНрд╡реЗрд░реА рдХреЗ рддрд░реНрдХ рдХреЛ рди рдмрджрд▓реЗрдВред
    рдЕрдкрдиреЗ рдЙрддреНрддрд░реЛрдВ рдореЗрдВ рдХреЛрдИ рднреА рд╡реНрдпрд╛рдЦреНрдпрд╛ рдпрд╛ рдорд╛рдлреА рд╢рд╛рдорд┐рд▓ рди рдХрд░реЗрдВред
    рдХреНрд╡реЗрд░реА рдХреЛ рдмреИрдХрдЯрд┐рдХреНрд╕ рдореЗрдВ рди рд▓рдкреЗрдЯреЗрдВред
    рдХреЗрд╡рд▓ рдЙрддреНрдкрдиреНрди рдХрд┐рдП рдЧрдП SPARQL рдХреНрд╡реЗрд░реА рдХреЛ рдЫреЛрдбрд╝рдХрд░ рдХреЛрдИ рдЕрдиреНрдп рдкрд╛рда рди рд╢рд╛рдорд┐рд▓ рдХрд░реЗрдВред
    рддреНрд░рд┐рдкрд▓ рдмреИрдХрдЯрд┐рдХреНрд╕ рджреНрд╡рд╛рд░рд╛ рд╕реАрдорд┐рдд рдЯрд░реНрдЯрд▓ рдкреНрд░рд╛рд░реВрдк рдореЗрдВ рд╡рд┐рд╢реЗрд╖рддрд╛ рд╕реНрдХреАрдорд╛ рд╣реИ:
    ```
    {schema}
    ```
    """

    GRAPHDB_SPARQL_FIX_PROMPT = PromptTemplate(
        input_variables=["error_message", "generated_sparql", "schema"],
        template=GRAPHDB_SPARQL_FIX_TEMPLATE,
    )
  ````

- `max_fix_retries`

    рдбрд┐рдлрд╝реЙрд▓реНрдЯ рдорд╛рди: `5`

### "рдЙрддреНрддрд░ рджреЗрдиреЗ" рдкреНрд░реЙрдореНрдкреНрдЯ

рдкреНрд░реЙрдореНрдкреНрдЯ рдХрд╛ рдЙрдкрдпреЛрдЧ рдбреЗрдЯрд╛рдмреЗрд╕ рд╕реЗ рдкреНрд░рд╛рдкреНрдд рдкрд░рд┐рдгрд╛рдореЛрдВ рдФрд░ рдкреНрд░рд╛рд░рдВрднрд┐рдХ рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдкреНрд░рд╢реНрди рдХреЗ рдЖрдзрд╛рд░ рдкрд░ рдкреНрд░рд╢реНрди рдХрд╛ рдЙрддреНрддрд░ рджреЗрдиреЗ рдХреЗ рд▓рд┐рдП рдХрд┐рдпрд╛ рдЬрд╛рддрд╛ рд╣реИред рдбрд┐рдлрд╝реЙрд▓реНрдЯ рд░реВрдк рд╕реЗ, рдПрд▓рдПрд▓рдПрдо рдХреЛ рдХреЗрд╡рд▓ рд╡рд╛рдкрд╕ рдЖрдП рдкрд░рд┐рдгрд╛рдо(реЛрдВ) рд╕реЗ рдЬрд╛рдирдХрд╛рд░реА рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдирд┐рд░реНрджреЗрд╢рд┐рдд рдХрд┐рдпрд╛ рдЬрд╛рддрд╛ рд╣реИред рдпрджрд┐ рдкрд░рд┐рдгрд╛рдо рд╕реЗрдЯ рдЦрд╛рд▓реА рд╣реИ, рддреЛ рдПрд▓рдПрд▓рдПрдо рдХреЛ рдмрддрд╛рдирд╛ рдЪрд╛рд╣рд┐рдП рдХрд┐ рд╡рд╣ рдкреНрд░рд╢реНрди рдХрд╛ рдЙрддреНрддрд░ рдирд╣реАрдВ рджреЗ рд╕рдХрддрд╛ред

- `qa_prompt`

  рдбрд┐рдлрд╝реЙрд▓реНрдЯ рдорд╛рди:
  ````python
    GRAPHDB_QA_TEMPLATE = """Task: Generate a natural language response from the results of a SPARQL query.
    You are an assistant that creates well-written and human understandable answers.
    The information part contains the information provided, which you can use to construct an answer.
    The information provided is authoritative, you must never doubt it or try to use your internal knowledge to correct it.
    Make your response sound like the information is coming from an AI assistant, but don't add any information.
    Don't use internal knowledge to answer the question, just say you don't know if no information is available.
    Information:
    {context}

    Question: {prompt}
    Helpful Answer:"""
    GRAPHDB_QA_PROMPT = PromptTemplate(
        input_variables=["context", "prompt"], template=GRAPHDB_QA_TEMPLATE
    )
  ````

рдПрдХ рдмрд╛рд░ рдЬрдм рдЖрдк GraphDB рдХреЗ рд╕рд╛рде QA рдХреЗ рд╕рд╛рде рдЦреЗрд▓ рдЪреБрдХреЗ рд╣реЛрдВ, рддреЛ рдЖрдк
``
docker compose down -v --remove-orphans
``
Docker compose рдлрд╝рд╛рдЗрд▓ рд╡рд╛рд▓реЗ рдирд┐рд░реНрджреЗрд╢рд┐рдХрд╛ рд╕реЗ рдЪрд▓рд╛рдХрд░ Docker рдкрд░реНрдпрд╛рд╡рд░рдг рдХреЛ рдмрдВрдж рдХрд░ рд╕рдХрддреЗ рд╣реИрдВред
