---
translated: true
---

# RDFLib

>[RDFLib](https://rdflib.readthedocs.io/) рдПрдХ рд╢реБрджреНрдз рдкрд╛рдпрдерди рдкреИрдХреЗрдЬ рд╣реИ рдЬреЛ [RDF](https://en.wikipedia.org/wiki/Resource_Description_Framework) рдХреЗ рд╕рд╛рде рдХрд╛рдо рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рд╣реИред `RDFLib` рдореЗрдВ рд╡рд╣ рд╕рдм рдХреБрдЫ рд╢рд╛рдорд┐рд▓ рд╣реИ рдЬрд┐рд╕рдХреА рдЖрдкрдХреЛ `RDF` рдХреЗ рд╕рд╛рде рдХрд╛рдо рдХрд░рдиреЗ рдХреА рдЖрд╡рд╢реНрдпрдХрддрд╛ рд╣реЛрддреА рд╣реИ, рдЬрд┐рд╕рдореЗрдВ рд╢рд╛рдорд┐рд▓ рд╣реИрдВ:
>- RDF/XML, N3, NTriples, N-Quads, Turtle, TriX, Trig рдФрд░ JSON-LD рдХреЗ рд▓рд┐рдП рдкрд╛рд░реНрд╕рд░реНрд╕ рдФрд░ рд╕реАрд░рд┐рдпрд▓рд╛рдЗрдЬрд╝рд░
>- рдПрдХ рдЧреНрд░рд╛рдлрд╝ рдЗрдВрдЯрд░рдлрд╝реЗрд╕ рдЬрд┐рд╕реЗ рдХрд┐рд╕реА рднреА рд╕реНрдЯреЛрд░ рдХрд╛рд░реНрдпрд╛рдиреНрд╡рдпрди рдореЗрдВ рд╕реЗ рдХрд┐рд╕реА рдПрдХ рджреНрд╡рд╛рд░рд╛ рд╕рдорд░реНрдерд┐рдд рдХрд┐рдпрд╛ рдЬрд╛ рд╕рдХрддрд╛ рд╣реИ
>- рдЗрди-рдореЗрдореЛрд░реА, рдбрд┐рд╕реНрдХ рдкрд░ рд╕реНрдерд╛рдпреА (Berkeley DB) рдФрд░ рд░рд┐рдореЛрдЯ SPARQL рдПрдВрдбрдкреЙрдЗрдВрдЯреНрд╕ рдХреЗ рд▓рд┐рдП рд╕реНрдЯреЛрд░ рдХрд╛рд░реНрдпрд╛рдиреНрд╡рдпрди
>- SPARQL 1.1 рдХрд╛рд░реНрдпрд╛рдиреНрд╡рдпрди - SPARQL 1.1 рдХреНрд╡реЗрд░реАрдЬрд╝ рдФрд░ рдЕрдкрдбреЗрдЯ рд╕реНрдЯреЗрдЯрдореЗрдВрдЯреНрд╕ рдХрд╛ рд╕рдорд░реНрдерди рдХрд░рддреЗ рд╣реБрдП
>- SPARQL рдлрд╝рдВрдХреНрд╢рди рдПрдХреНрд╕рдЯреЗрдВрд╢рди рдореЗрдХреЗрдирд┐рдЬреНрдо

рдиреЗрдЯрд╡рд░реНрдХ-рдЬреИрд╕реЗ рдореЙрдбрд▓ рдкрд░ рдЖрдзрд╛рд░рд┐рдд рдЕрдиреБрдкреНрд░рдпреЛрдЧреЛрдВ рдХреЗ рд▓рд┐рдП рдЧреНрд░рд╛рдлрд╝ рдбреЗрдЯрд╛рдмреЗрд╕ рдПрдХ рдЙрддреНрдХреГрд╖реНрдЯ рд╡рд┐рдХрд▓реНрдк рд╣реИрдВред рдРрд╕реЗ рдЧреНрд░рд╛рдлрд╝ рдХреА рд╕рд┐рдВрдЯреИрдХреНрд╕ рдФрд░ рдЕрд░реНрде рдХреЛ рдорд╛рдирдХреАрдХреГрдд рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП, W3C `Semantic Web Technologies` рдХреА рд╕рд┐рдлрд╛рд░рд┐рд╢ рдХрд░рддрд╛ рд╣реИ, рджреЗрдЦреЗрдВ [Semantic Web](https://www.w3.org/standards/semanticweb/)ред

[SPARQL](https://www.w3.org/TR/sparql11-query/) рдЗрди рдЧреНрд░рд╛рдлрд╝реНрд╕ рдХреЗ рд▓рд┐рдП рдПрдХ рдХреНрд╡реЗрд░реА рднрд╛рд╖рд╛ рдХреЗ рд░реВрдк рдореЗрдВ рдХрд╛рд░реНрдп рдХрд░рддрд╛ рд╣реИ, рдЬреИрд╕реЗ рдХрд┐ `SQL` рдпрд╛ `Cypher`ред рдпрд╣ рдиреЛрдЯрдмреБрдХ LLMs рдХреЛ рдПрдХ рдкреНрд░рд╛рдХреГрддрд┐рдХ рднрд╛рд╖рд╛ рдЗрдВрдЯрд░рдлрд╝реЗрд╕ рдХреЗ рд░реВрдк рдореЗрдВ рдПрдХ рдЧреНрд░рд╛рдлрд╝ рдбреЗрдЯрд╛рдмреЗрд╕ рдХреЗ рд▓рд┐рдП SPARQL рдЙрддреНрдкрдиреНрди рдХрд░рдХреЗ рдЙрдирдХреЗ рдЕрдиреБрдкреНрд░рдпреЛрдЧ рдХреЛ рджрд░реНрд╢рд╛рддрд╛ рд╣реИред

**рдЕрд╕реНрд╡реАрдХрд░рдг:** рдЖрдЬ рддрдХ, LLMs рдХреЗ рдорд╛рдзреНрдпрдо рд╕реЗ `SPARQL` рдХреНрд╡реЗрд░реА рдЙрддреНрдкрдиреНрди рдХрд░рдирд╛ рдЕрднреА рднреА рдереЛрдбрд╝рд╛ рдЕрд╕реНрдерд┐рд░ рд╣реИред рд╡рд┐рд╢реЗрд╖ рд░реВрдк рд╕реЗ `UPDATE` рдХреНрд╡реЗрд░реАрдЬрд╝ рдХреЗ рд╕рд╛рде рд╕рд╛рд╡рдзрд╛рди рд░рд╣реЗрдВ, рдЬреЛ рдЧреНрд░рд╛рдлрд╝ рдХреЛ рдмрджрд▓рддреЗ рд╣реИрдВред

## рд╕реЗрдЯрдЕрдк рдХрд░рдирд╛

рд╣рдореЗрдВ рдПрдХ рдкрд╛рдпрдерди рд▓рд╛рдЗрдмреНрд░реЗрд░реА рд╕реНрдерд╛рдкрд┐рдд рдХрд░рдиреА рд╣реЛрдЧреА:

```python
!pip install rdflib
```

рдРрд╕реЗ рдХрдИ рд╕реНрд░реЛрдд рд╣реИрдВ рдЬрд┐рдирдХреЗ рд╡рд┐рд░реБрджреНрдз рдЖрдк рдХреНрд╡реЗрд░реА рдЪрд▓рд╛ рд╕рдХрддреЗ рд╣реИрдВ, рдЬрд┐рдирдореЗрдВ рд╡реЗрдм рдкрд░ рдлрд╛рдЗрд▓реЗрдВ, рд╕реНрдерд╛рдиреАрдп рд░реВрдк рд╕реЗ рдЙрдкрд▓рдмреНрдз рдлрд╛рдЗрд▓реЗрдВ, SPARQL рдПрдВрдбрдкреЙрдЗрдВрдЯреНрд╕, рдЬреИрд╕реЗ [Wikidata](https://www.wikidata.org/wiki/Wikidata:Main_Page), рдФрд░ [рдЯреНрд░рд┐рдкрд▓ рд╕реНрдЯреЛрд░реНрд╕](https://www.w3.org/wiki/LargeTripleStores) рд╢рд╛рдорд┐рд▓ рд╣реИрдВред

```python
from langchain.chains import GraphSparqlQAChain
from langchain_community.graphs import RdfGraph
from langchain_openai import ChatOpenAI
```

```python
graph = RdfGraph(
    source_file="http://www.w3.org/People/Berners-Lee/card",
    standard="rdf",
    local_copy="test.ttl",
)
```

рдзреНрдпрд╛рди рджреЗрдВ рдХрд┐ рдпрджрд┐ рд╕реНрд░реЛрдд рдХреЗрд╡рд▓-рдкрдврд╝рдиреЗ рд╡рд╛рд▓рд╛ рд╣реИ, рддреЛ рд╕реНрдерд╛рдиреАрдп рд░реВрдк рд╕реЗ рдкрд░рд┐рд╡рд░реНрддрди рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП `local_file` рдкреНрд░рджрд╛рди рдХрд░рдирд╛ рдЖрд╡рд╢реНрдпрдХ рд╣реИред

## рдЧреНрд░рд╛рдл рд╕реНрдХреАрдорд╛ рдЬрд╛рдирдХрд╛рд░реА рдХреЛ рд░реАрдлреНрд░реЗрд╢ рдХрд░рдирд╛

рдпрджрд┐ рдбреЗрдЯрд╛рдмреЗрд╕ рдХрд╛ рд╕реНрдХреАрдорд╛ рдмрджрд▓рддрд╛ рд╣реИ, рддреЛ рдЖрдк SPARQL рдХреНрд╡реЗрд░реА рдЙрддреНрдкрдиреНрди рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдЖрд╡рд╢реНрдпрдХ рд╕реНрдХреАрдорд╛ рдЬрд╛рдирдХрд╛рд░реА рдХреЛ рд░реАрдлреНрд░реЗрд╢ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВред

```python
graph.load_schema()
```

```python
graph.get_schema
```

```output
In the following, each IRI is followed by the local name and optionally its description in parentheses.
The RDF graph supports the following node types:
<http://xmlns.com/foaf/0.1/PersonalProfileDocument> (PersonalProfileDocument, None), <http://www.w3.org/ns/auth/cert#RSAPublicKey> (RSAPublicKey, None), <http://www.w3.org/2000/10/swap/pim/contact#Male> (Male, None), <http://xmlns.com/foaf/0.1/Person> (Person, None), <http://www.w3.org/2006/vcard/ns#Work> (Work, None)
The RDF graph supports the following relationships:
<http://www.w3.org/2000/01/rdf-schema#seeAlso> (seeAlso, None), <http://purl.org/dc/elements/1.1/title> (title, None), <http://xmlns.com/foaf/0.1/mbox_sha1sum> (mbox_sha1sum, None), <http://xmlns.com/foaf/0.1/maker> (maker, None), <http://www.w3.org/ns/solid/terms#oidcIssuer> (oidcIssuer, None), <http://www.w3.org/2000/10/swap/pim/contact#publicHomePage> (publicHomePage, None), <http://xmlns.com/foaf/0.1/openid> (openid, None), <http://www.w3.org/ns/pim/space#storage> (storage, None), <http://xmlns.com/foaf/0.1/name> (name, None), <http://www.w3.org/2000/10/swap/pim/contact#country> (country, None), <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> (type, None), <http://www.w3.org/ns/solid/terms#profileHighlightColor> (profileHighlightColor, None), <http://www.w3.org/ns/pim/space#preferencesFile> (preferencesFile, None), <http://www.w3.org/2000/01/rdf-schema#label> (label, None), <http://www.w3.org/ns/auth/cert#modulus> (modulus, None), <http://www.w3.org/2000/10/swap/pim/contact#participant> (participant, None), <http://www.w3.org/2000/10/swap/pim/contact#street2> (street2, None), <http://www.w3.org/2006/vcard/ns#locality> (locality, None), <http://xmlns.com/foaf/0.1/nick> (nick, None), <http://xmlns.com/foaf/0.1/homepage> (homepage, None), <http://creativecommons.org/ns#license> (license, None), <http://xmlns.com/foaf/0.1/givenname> (givenname, None), <http://www.w3.org/2006/vcard/ns#street-address> (street-address, None), <http://www.w3.org/2006/vcard/ns#postal-code> (postal-code, None), <http://www.w3.org/2000/10/swap/pim/contact#street> (street, None), <http://www.w3.org/2003/01/geo/wgs84_pos#lat> (lat, None), <http://xmlns.com/foaf/0.1/primaryTopic> (primaryTopic, None), <http://www.w3.org/2006/vcard/ns#fn> (fn, None), <http://www.w3.org/2003/01/geo/wgs84_pos#location> (location, None), <http://usefulinc.com/ns/doap#developer> (developer, None), <http://www.w3.org/2000/10/swap/pim/contact#city> (city, None), <http://www.w3.org/2006/vcard/ns#region> (region, None), <http://xmlns.com/foaf/0.1/member> (member, None), <http://www.w3.org/2003/01/geo/wgs84_pos#long> (long, None), <http://www.w3.org/2000/10/swap/pim/contact#address> (address, None), <http://xmlns.com/foaf/0.1/family_name> (family_name, None), <http://xmlns.com/foaf/0.1/account> (account, None), <http://xmlns.com/foaf/0.1/workplaceHomepage> (workplaceHomepage, None), <http://purl.org/dc/terms/title> (title, None), <http://www.w3.org/ns/solid/terms#publicTypeIndex> (publicTypeIndex, None), <http://www.w3.org/2000/10/swap/pim/contact#office> (office, None), <http://www.w3.org/2000/10/swap/pim/contact#homePage> (homePage, None), <http://xmlns.com/foaf/0.1/mbox> (mbox, None), <http://www.w3.org/2000/10/swap/pim/contact#preferredURI> (preferredURI, None), <http://www.w3.org/ns/solid/terms#profileBackgroundColor> (profileBackgroundColor, None), <http://schema.org/owns> (owns, None), <http://xmlns.com/foaf/0.1/based_near> (based_near, None), <http://www.w3.org/2006/vcard/ns#hasAddress> (hasAddress, None), <http://xmlns.com/foaf/0.1/img> (img, None), <http://www.w3.org/2000/10/swap/pim/contact#assistant> (assistant, None), <http://xmlns.com/foaf/0.1/title> (title, None), <http://www.w3.org/ns/auth/cert#key> (key, None), <http://www.w3.org/ns/ldp#inbox> (inbox, None), <http://www.w3.org/ns/solid/terms#editableProfile> (editableProfile, None), <http://www.w3.org/2000/10/swap/pim/contact#postalCode> (postalCode, None), <http://xmlns.com/foaf/0.1/weblog> (weblog, None), <http://www.w3.org/ns/auth/cert#exponent> (exponent, None), <http://rdfs.org/sioc/ns#avatar> (avatar, None)
```

## рдЧреНрд░рд╛рдлрд╝ рдХреЛ рдХреНрд╡реЗрд░реА рдХрд░рдирд╛

рдЕрдм, рдЖрдк рдЧреНрд░рд╛рдлрд╝ SPARQL QA рдЪреЗрди рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ рдЧреНрд░рд╛рдлрд╝ рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ рдкреНрд░рд╢реНрди рдкреВрдЫ рд╕рдХрддреЗ рд╣реИрдВред

```python
chain = GraphSparqlQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True
)
```

```python
chain.run("What is Tim Berners-Lee's work homepage?")
```

```output


[1m> Entering new GraphSparqlQAChain chain...[0m
Identified intent:
[32;1m[1;3mSELECT[0m
Generated SPARQL:
[32;1m[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?homepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?homepage .
}[0m
Full Context:
[32;1m[1;3m[][0m

[1m> Finished chain.[0m
```

```output
"Tim Berners-Lee's work homepage is http://www.w3.org/People/Berners-Lee/."
```

## рдЧреНрд░рд╛рдлрд╝ рдХреЛ рдЕрдкрдбреЗрдЯ рдХрд░рдирд╛

рдЗрд╕реА рддрд░рд╣, рдЖрдк рдкреНрд░рд╛рдХреГрддрд┐рдХ рднрд╛рд╖рд╛ рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ рдЧреНрд░рд╛рдлрд╝ рдХреЛ рдЕрдкрдбреЗрдЯ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ, рдЕрд░реНрдерд╛рдд рдЯреНрд░рд┐рдкрд▓реНрд╕ рдХреЛ рд╕рдореНрдорд┐рд▓рд┐рдд рдХрд░ рд╕рдХрддреЗ рд╣реИрдВред

```python
chain.run(
    "Save that the person with the name 'Timothy Berners-Lee' has a work homepage at 'http://www.w3.org/foo/bar/'"
)
```

```output


[1m> Entering new GraphSparqlQAChain chain...[0m
Identified intent:
[32;1m[1;3mUPDATE[0m
Generated SPARQL:
[32;1m[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>
INSERT {
    ?person foaf:workplaceHomepage <http://www.w3.org/foo/bar/> .
}
WHERE {
    ?person foaf:name "Timothy Berners-Lee" .
}[0m

[1m> Finished chain.[0m
```

```output
'Successfully inserted triples into the graph.'
```

рдЖрдЗрдП рдкрд░рд┐рдгрд╛рдореЛрдВ рдХреЛ рд╕рддреНрдпрд╛рдкрд┐рдд рдХрд░реЗрдВ:

```python
query = (
    """PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n"""
    """SELECT ?hp\n"""
    """WHERE {\n"""
    """    ?person foaf:name "Timothy Berners-Lee" . \n"""
    """    ?person foaf:workplaceHomepage ?hp .\n"""
    """}"""
)
graph.query(query)
```

```output
[(rdflib.term.URIRef('https://www.w3.org/'),),
 (rdflib.term.URIRef('http://www.w3.org/foo/bar/'),)]
```

## SPARQL рдХреНрд╡реЗрд░реА рд▓реМрдЯрд╛рдПрдВ

рдЖрдк `return_sparql_query` рдкреИрд░рд╛рдореАрдЯрд░ рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ Sparql QA рдЪреЗрди рд╕реЗ SPARQL рдХреНрд╡реЗрд░реА рдЪрд░рдг рдХреЛ рд▓реМрдЯрд╛ рд╕рдХрддреЗ рд╣реИрдВред

```python
chain = GraphSparqlQAChain.from_llm(
    ChatOpenAI(temperature=0), graph=graph, verbose=True, return_sparql_query=True
)
```

```python
result = chain("What is Tim Berners-Lee's work homepage?")
print(f"SQARQL query: {result['sparql_query']}")
print(f"Final answer: {result['result']}")
```

```output


[1m> Entering new GraphSparqlQAChain chain...[0m
Identified intent:
[32;1m[1;3mSELECT[0m
Generated SPARQL:
[32;1m[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?workHomepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?workHomepage .
}[0m
Full Context:
[32;1m[1;3m[][0m

[1m> Finished chain.[0m
SQARQL query: PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?workHomepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?workHomepage .
}
Final answer: Tim Berners-Lee's work homepage is http://www.w3.org/People/Berners-Lee/.
```

```python
print(result["sparql_query"])
```

```output
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?workHomepage
WHERE {
    ?person foaf:name "Tim Berners-Lee" .
    ?person foaf:workplaceHomepage ?workHomepage .
}
```
